
Talented_Data_HUNTER = {
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化雄鹰守护",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 136076,
					["row"] = 1,
					["tips"] = "当雄鹰守护处于激活状态时，所有普通的远程攻击都有10%的几率使你的远程攻击速度提高3%，持续12秒。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "耐久训练",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136080,
					["row"] = 1,
					["tips"] = "使你的宠物的生命值提高2%，你的生命总值提高1%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "火力集中",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132210,
					["row"] = 2,
					["tips"] = "在你的宠物处于激活状态下时，使你所造成的所有伤害提高1%，你的杀戮命令技能的爆击几率提高10%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化灵猴守护",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 132159,
					["row"] = 2,
					["tips"] = "使你的灵猴守护提供2%的额外躲闪几率。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "厚皮",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 134355,
					["row"] = 2,
					["tips"] = "使你的宠物的护甲等级提高7%，你的装备所提供的护甲加成提高4%。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强化复活宠物",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 132163,
					["row"] = 2,
					["tips"] = "使你的复活宠物法术的施法时间减少3秒，法力值消耗降低20%，宠物复活后的生命值提高15%。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "寻路",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132242,
					["row"] = 3,
					["tips"] = "使你的猎豹守护和豹群守护的速度加成效果提高4%。",
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "野兽迅捷",
					["ranks"] = 1,
					["column"] = 2,
					["icon"] = 132120,
					["row"] = 3,
					["tips"] = "使你的宠物在户外的移动速度提高30%。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "狂怒释放",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132091,
					["row"] = 3,
					["tips"] = "使你的宠物所造成的伤害提高4%。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化治疗宠物",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 132179,
					["row"] = 4,
					["tips"] = "使你的治疗宠物技能所消耗的法力值减少10%，并且有25%的几率每一跳驱散宠物身上的1个诅咒、疾病、魔法或中毒效果。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "凶暴",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 134297,
					["row"] = 4,
					["tips"] = "使你的宠物的爆击几率提高2%。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "灵魂联结",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132121,
					["row"] = 5,
					["tips"] = "当你的宠物被激活后，你和你的宠物都会每10秒回复1%的生命值。",
				},
			}, -- [12]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "胁迫",
					["icon"] = 132111,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "命令你的宠物在下次击中敌人时进行胁迫，造成大量的威胁值，并使目标昏迷3秒。",
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "野兽戒律",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 136006,
					["row"] = 5,
					["tips"] = "使你的宠物的集中值回复速度提高50%。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "驭兽者",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132158,
					["row"] = 6,
					["tips"] = "使你的骑乘速度提高4%，宠物的攻击命中率提高2%。此骑乘速度加成效果不与其它同类效果叠加。",
				},
			}, -- [15]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 4,
							["source"] = 11,
						}, -- [1]
					},
					["name"] = "狂乱",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 134296,
					["row"] = 6,
					["tips"] = "使你的宠物有20%的几率在对敌人造成爆击后获得攻击速度提高30%的效果，持续8秒。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "凶猛灵感",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132173,
					["row"] = 7,
					["tips"] = "当你的宠物打出爆击之后，所有小队成员造成的所有伤害提高1%，效果持续10秒。",
				},
			}, -- [17]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "狂野怒火",
					["icon"] = 132127,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "使宠物进入疯狂状态，对目标造成的伤害提高50%，持续18秒。在这种状态下，宠物不会有任何恐惧或怜悯，也无法停止下来，除非被杀死。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "猎豹反射",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132167,
					["row"] = 7,
					["tips"] = "使你的躲闪几率提高1%，你的宠物的躲闪几率提高3%。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "蛇之迅捷",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132209,
					["row"] = 8,
					["tips"] = "你的远程攻击速度提高4%，你的宠物的近战攻击速度提高4%。",
				},
			}, -- [20]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "野兽之心",
					["ranks"] = 1,
					["column"] = 2,
					["icon"] = 132166,
					["row"] = 9,
					["tips"] = "当你的宠物激活狂野怒火之后，你也会进入狂暴状态，对目标造成的伤害提高10%，所有法术所消耗的法力值降低20%，效果持续18秒。在这种状态下，你不会有任何恐惧或怜悯，也无法停止下来，除非被杀死。",
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "野兽控制",
			["background"] = "HunterBeastMastery",
		},
	}, -- [1]
	{
		["numtalents"] = 20,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化震荡射击",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135860,
					["row"] = 1,
					["tips"] = "使你的震荡射击有4%的几率令目标昏迷3秒。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "夺命射击",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132312,
					["row"] = 1,
					["tips"] = "使你的远程武器造成爆击的几率提高1%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "强化猎人印记",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132212,
					["row"] = 2,
					["tips"] = "使你的猎人印记也提供近战攻击强度加成效果，数值相当于远程攻击强度加成的基础值的20%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "效率",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135865,
					["row"] = 2,
					["tips"] = "使你施放射击和钉刺技能所消耗的法力值减少2%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "直取要害",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132174,
					["row"] = 3,
					["tips"] = "你的远程爆击可以令你的宠物回复25点集中值。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强化奥术射击",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132218,
					["row"] = 3,
					["tips"] = "使你的奥术射击的冷却时间减少0.2秒。",
				},
			}, -- [6]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "瞄准射击",
					["icon"] = 135130,
					["column"] = 3,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "瞄准目标射击，使远程伤害提高70点，并使其受到的治疗效果降低50%。持续10秒。",
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "疾速杀戮",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 132205,
					["row"] = 3,
					["tips"] = "使你的急速射击技能的冷却时间减少1分钟。另外，在杀死一个能够使你获得经验值或荣誉值的敌人之后，你的下一次瞄准射击、奥术射击或自动射击所造成的伤害提高10%，效果持续20秒。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "强化钉刺",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132204,
					["row"] = 4,
					["tips"] = "使你的毒蛇钉刺和翼龙钉刺所造成的伤害提高6%，蝰蛇钉刺所吸取的法力值提高6%，另外还可使你的钉刺被驱散的几率降低6%。",
				},
			}, -- [9]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 7,
						}, -- [1]
					},
					["name"] = "致死射击",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132271,
					["row"] = 4,
					["tips"] = "使你的远程武器爆击伤害提高6%。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "冲击弹幕",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135753,
					["row"] = 5,
					["tips"] = "你的自动射击命中目标后有2%的几率令目标眩晕4秒。",
				},
			}, -- [11]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "驱散射击",
					["icon"] = 132153,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "短程射击，对目标造成50%的武器伤害，并使其困惑4秒。任何伤害都会打断该效果。使用之后结束你的攻击。",
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "弹幕",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132330,
					["row"] = 5,
					["tips"] = "使你的多重射击和乱射的伤害提高4%。",
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "战斗经验",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132168,
					["row"] = 6,
					["tips"] = "使你的敏捷总值提高1%，智力总值提高3%。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "远程武器专精",
					["ranks"] = 5,
					["column"] = 4,
					["icon"] = 135615,
					["row"] = 6,
					["tips"] = "使你的远程武器伤害提高1%。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "精确瞄准",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132217,
					["row"] = 7,
					["tips"] = "使你的远程攻击强度提高，数值相当于你的智力总值的15%。",
				},
			}, -- [16]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 12,
						}, -- [1]
					},
					["name"] = "强击光环",
					["icon"] = 132329,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "使半径45码范围内的小队成员的攻击强度提高50点，持续直到主动取消。",
				},
			}, -- [17]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "强化弹幕",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132330,
					["row"] = 7,
					["tips"] = "使你的多重射击技能的爆击几率提高4%，并且使你有33%的几率在引导乱射技能时不会因受到伤害而被打断。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "狙击高手",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132177,
					["row"] = 8,
					["tips"] = "使你的远程攻击强度提高2%。",
				},
			}, -- [19]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 8,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "沉默射击",
					["icon"] = 132323,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "射击敌人，对其造成50%的武器伤害，并使其沉默3秒。",
				},
			}, -- [20]
		},
		["info"] = {
			["name"] = "射击",
			["background"] = "HunterMarksmanship",
		},
	}, -- [2]
	{
		["numtalents"] = 23,
		["talents"] = {
			{
				["info"] = {
					["name"] = "怪物杀手",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 134154,
					["row"] = 1,
					["tips"] = "使你对野兽、巨人和龙类所造成的所有伤害提高1%，对野兽、巨人和龙类所造成的爆击伤害提高1%。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "人型生物杀手",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135942,
					["row"] = 1,
					["tips"] = "使你对人型生物目标所造成的所有伤害提高1%，对人型生物目标所造成的爆击伤害提高1%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "鹰眼",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132327,
					["row"] = 1,
					["tips"] = "使你的远程武器的射程延长2码。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "野蛮打击",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 132277,
					["row"] = 1,
					["tips"] = "使你的猛禽一击和猫鼬撕咬的爆击几率提高10%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "诱捕",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 136100,
					["row"] = 2,
					["tips"] = "使你的献祭陷阱、冰霜陷阱、爆炸陷阱和毒蛇陷阱有8%的几率困住目标，令它们无法移动，持续4秒。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "偏斜",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132269,
					["row"] = 2,
					["tips"] = "使你的招架几率提高1%。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化摔绊",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132309,
					["row"] = 2,
					["tips"] = "使你的摔绊技能有7%的几率令目标在5秒内无法移动。",
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "灵巧陷阱",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 136106,
					["row"] = 3,
					["tips"] = "使你的冰冻陷阱和冰霜陷阱的效果持续时间提高15%，献祭陷阱和爆炸陷阱所造成的伤害提高15%，毒蛇陷阱所召唤的毒蛇数量提高15%。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "生存专家",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 136223,
					["row"] = 3,
					["tips"] = "使你的生命值上限提高2%。",
				},
			}, -- [9]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "威慑",
					["icon"] = 132369,
					["column"] = 3,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "激活之后，使你的躲闪和招架几率提高25%，持续10秒。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "陷阱掌握",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132149,
					["row"] = 4,
					["tips"] = "使敌人抵抗你的陷阱效果的几率降低5%。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "稳固",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 132219,
					["row"] = 4,
					["tips"] = "使你的攻击命中敌人的几率提高1%，并使你抵抗移动限制效果的几率提高5%。",
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "强化假死",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 132293,
					["row"] = 4,
					["tips"] = "使敌人抵抗你的假死技能的几率降低2%。",
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "生存本能",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132214,
					["row"] = 5,
					["tips"] = "受到的所有伤害降低2%，攻击强度提高2%。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "杀戮本能",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135881,
					["row"] = 5,
					["tips"] = "使你的所有攻击造成爆击的几率提高1%。",
				},
			}, -- [15]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 10,
						}, -- [1]
					},
					["name"] = "反击",
					["icon"] = 132336,
					["column"] = 3,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "在招架敌人的攻击之后可以使用的技能，对敌人造成40点伤害，并使其无法行动，持续5秒。反击无法被格挡、躲闪或招架。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "足智多谋",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132207,
					["row"] = 6,
					["tips"] = "使你的所有陷阱和近战技能所消耗的法力值减少20%，所有陷阱的冷却时间缩短2秒。",
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "闪电反射",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136047,
					["row"] = 6,
					["tips"] = "使你的敏捷提高3%。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "狩猎刺激",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132216,
					["row"] = 7,
					["tips"] = "你有33%的几率在任何射击技能爆击之后回复该技能消耗法力值的40%。",
				},
			}, -- [19]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 15,
						}, -- [1]
					},
					["name"] = "翼龙钉刺",
					["icon"] = 135125,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "钉刺目标，使其沉睡12秒。任何伤害都会取消沉睡效果。当目标醒来时，钉刺会在12秒内对其造成300点自然伤害。每个猎人在同一时间内只能对一个目标使用一种钉刺，且同类钉刺无法叠加。",
				},
			}, -- [20]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 6,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "破甲虚弱",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132295,
					["row"] = 7,
					["tips"] = "你的远程爆击有33%的几率为目标附加破甲虚弱效果，令所有攻击对该目标的攻击强度提高，数值相当于你的敏捷值的25%，效果持续7秒。",
				},
			}, -- [21]
			{
				["info"] = {
					["name"] = "战术大师",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132178,
					["row"] = 8,
					["tips"] = "你的远程攻击命中后有6%的几率使你的所有攻击的爆击几率提高2%，效果持续8秒。",
				},
			}, -- [22]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 8,
							["source"] = 22,
						}, -- [1]
					},
					["name"] = "准备就绪",
					["icon"] = 132206,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "激活之后，这个技能立刻使你的其它猎人技能的冷却时间结束。",
				},
			}, -- [23]
		},
		["info"] = {
			["name"] = "生存",
			["background"] = "HunterSurvival",
		},
	}, -- [3]
}
Talented_Data_WARRIOR = {
	{
		["numtalents"] = 23,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化英勇打击",
					["tips"] = "使你的英勇打击技能所消耗的怒气值减少1点。",
					["column"] = 1,
					["row"] = 1,
					["icon"] = 132282,
					["ranks"] = 3,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "偏斜",
					["tips"] = "使你的招架几率提高1%。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 132269,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "强化撕裂",
					["tips"] = "使你的撕裂技能的流血伤害效果提高25%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 132155,
					["ranks"] = 3,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化冲锋",
					["tips"] = "使你的冲锋技能积攒的怒气值提高3点。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 132337,
					["ranks"] = 2,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "钢铁意志",
					["tips"] = "使你抵抗昏迷和魅惑效果的几率提高3%。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 135995,
					["ranks"] = 5,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强化雷霆一击",
					["tips"] = "使你的雷霆一击技能所消耗的怒气值减少1点，伤害提高40%，减速效果提高4%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 132326,
					["ranks"] = 3,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化压制",
					["tips"] = "使你的压制技能造成爆击的几率提高25%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 135275,
					["ranks"] = 2,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "在战斗中每3秒获得1点怒气值。",
					["name"] = "愤怒掌控",
					["row"] = 3,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 135881,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "重伤",
					["tips"] = "你的爆击导致目标流血，使其在12秒内遭受相当于你的武器平均伤害值的20%的伤害。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 132090,
					["ranks"] = 3,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "双手武器专精",
					["tips"] = "使你的双手近战武器伤害提高1%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 132400,
					["ranks"] = 5,
				},
			}, -- [10]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 9,
						}, -- [1]
					},
					["name"] = "穿刺",
					["tips"] = "使你在战斗姿态、防御姿态和狂暴姿态下的各种技能的爆击伤害加成提高10%。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 132312,
					["ranks"] = 2,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "长柄专精",
					["tips"] = "使你的斧类武器和长柄武器的爆击几率提高1%。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 132397,
					["ranks"] = 5,
				},
			}, -- [12]
			{
				["info"] = {
					["tips"] = "激活之后，你的物理攻击伤害提高20%，并免疫恐惧效果，但是受到任何攻击时所承受的伤害都提高5%。持续30秒。",
					["name"] = "死亡之愿",
					["row"] = 5,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136146,
					["ranks"] = 1,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "锤类武器专精",
					["tips"] = "使你的锤类武器在击中目标时有一定几率将其击晕3秒，并获得7点怒气值。",
					["column"] = 3,
					["row"] = 5,
					["icon"] = 133476,
					["ranks"] = 5,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "剑类武器专精",
					["tips"] = "使你在用剑类武器击中敌人后有1%的几率对同一目标进行一次额外的攻击。",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 135328,
					["ranks"] = 5,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "强化拦截",
					["tips"] = "使你的拦截技能的冷却时间减少5秒。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 132307,
					["ranks"] = 2,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "强化断筋",
					["tips"] = "使你的断筋技能有5%的几率令目标无法移动，持续5秒。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 132316,
					["ranks"] = 3,
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "强化戒律",
					["tips"] = "使你的反击风暴、鲁莽和盾墙技能的冷却时间减少4分钟，持续时间延长2秒。",
					["column"] = 4,
					["row"] = 6,
					["icon"] = 132346,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "血性狂乱",
					["tips"] = "你的撕裂和重伤技能也可以使目标受到的所有物理伤害提高2%。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 132334,
					["ranks"] = 2,
				},
			}, -- [19]
			{
				["info"] = {
					["tips"] = "一次邪恶的攻击，对目标造成武器伤害外加85点伤害，并使任何形式的治疗对其产生的效果降低50%，持续10秒。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "致死打击",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132355,
					["ranks"] = 1,
				},
			}, -- [20]
			{
				["info"] = {
					["name"] = "复苏之风",
					["tips"] = "当你受到昏迷或定身效果影响时，你将在10秒内获得10点怒气值和生命总值的5%。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 132175,
					["ranks"] = 2,
				},
			}, -- [21]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 20,
						}, -- [1]
					},
					["name"] = "强化致死打击",
					["tips"] = "使你的致死打击技能的冷却时间减少0.2秒，伤害提高1%。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 132355,
					["ranks"] = 5,
				},
			}, -- [22]
			{
				["info"] = {
					["tips"] = "在对敌人造成伤害时产生的怒气值提高25%。",
					["name"] = "无尽怒气",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132344,
					["ranks"] = 1,
				},
			}, -- [23]
		},
		["info"] = {
			["name"] = "武器",
			["background"] = "WarriorArms",
		},
	}, -- [1]
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "震耳嗓音",
					["tips"] = "使你的战斗怒吼、挫志怒吼和命令怒吼的作用范围和持续时间提高10%。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136075,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "残忍",
					["tips"] = "使你用近战武器对敌人造成爆击的几率提高1%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 132292,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "强化挫志怒吼",
					["tips"] = "使你的挫志怒吼技能降低敌人近战攻击强度的效果提高8%。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 132366,
					["ranks"] = 5,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "怒不可遏",
					["tips"] = "使你有一定几率在对敌人造成近战伤害之后获得1个额外的怒气点数。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 136097,
					["ranks"] = 5,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "强化顺劈斩",
					["tips"] = "使你的顺劈斩技能附加的伤害提高40%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 132338,
					["ranks"] = 3,
				},
			}, -- [5]
			{
				["info"] = {
					["tips"] = "使战士身边半径10码范围内的所有敌人眩晕，移动速度降低50%，持续6秒。",
					["name"] = "刺耳怒吼",
					["row"] = 3,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136147,
					["ranks"] = 1,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "血之狂热",
					["tips"] = "在受到爆击之后的6秒内为你回复生命值总量的1%。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 136218,
					["ranks"] = 3,
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "统御之力",
					["tips"] = "使你的战斗怒吼所提供的近战攻击强度加成和命令怒吼所提供的生命值加成提高5%。",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 136035,
					["ranks"] = 5,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "双武器专精",
					["tips"] = "使你的副手武器伤害提高5%。",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 132147,
					["ranks"] = 5,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化斩杀",
					["tips"] = "使你的斩杀技能的怒气值消耗减少2点。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 135358,
					["ranks"] = 2,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "激怒",
					["tips"] = "使你在遭到敌人的爆击之后所进行的最多12次近战攻击都获得5%的额外伤害加值，效果持续12秒。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 136224,
					["ranks"] = 5,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "强化猛击",
					["tips"] = "使你的猛击技能的施放时间减少0.5秒。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 132340,
					["ranks"] = 2,
				},
			}, -- [12]
			{
				["info"] = {
					["tips"] = "你在接下来的10次近战攻击中可以攻击到一个额外的敌人。",
					["name"] = "横扫攻击",
					["row"] = 5,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132306,
					["ranks"] = 1,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "武器掌握",
					["tips"] = "使你的攻击被躲闪的几率降低1%，并使你受到的缴械效果持续时间缩短25%。不与其它缴械时间缩短效果叠加。",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 132367,
					["ranks"] = 2,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "强化狂暴之怒",
					["tips"] = "在使用狂暴之怒技能之后获得5点怒气值。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 136009,
					["ranks"] = 2,
				},
			}, -- [15]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 4,
							["source"] = 11,
						}, -- [1]
					},
					["name"] = "乱舞",
					["tips"] = "在你的普通近战攻击打出爆击之后，使你的下3次近战攻击速度提高5%。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 132152,
					["ranks"] = 5,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "精确",
					["tips"] = "使你的近战武器的命中几率提高1%。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 132222,
					["ranks"] = 3,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "立刻攻击目标，对其造成12点伤害。另外，你的下5次成功的近战攻击每次都可令你回复10点生命值。效果持续8秒。攻击强度会影响伤害的数值。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "嗜血",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136012,
					["ranks"] = 1,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "强化旋风斩",
					["tips"] = "使你的旋风斩技能的冷却时间减少1秒。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 132369,
					["ranks"] = 2,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "强化狂暴姿态",
					["tips"] = "在狂暴姿态下的攻击强度提高2%，威胁值降低2%。",
					["column"] = 3,
					["row"] = 8,
					["icon"] = 132275,
					["ranks"] = 5,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "战士进入暴怒状态，攻击强度提高30点，大部分成功命中的近战攻击都可以令攻击强度继续提高30点。这个效果可以叠加最多5次，持续30秒。只能在打出爆击之后使用此技能。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "暴怒",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132352,
					["ranks"] = 1,
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "狂怒",
			["background"] = "WarriorFury",
		},
	}, -- [2]
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化血性狂暴",
					["tips"] = "使你的血性狂暴技能激活时所产生的怒气值增加3点。",
					["column"] = 1,
					["row"] = 1,
					["icon"] = 132277,
					["ranks"] = 2,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "战术掌握",
					["tips"] = "在改变姿态的时候可以保留的怒气值上限提高5点，同时极大提高你在防御姿态下使用嗜血和致死打击技能所造成的威胁值。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136031,
					["ranks"] = 3,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "预知",
					["tips"] = "使你的防御技能提高4点。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 136056,
					["ranks"] = 5,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "盾牌专精",
					["tips"] = "使你用盾牌格挡攻击的几率提高1%，在成功格档后有20%的几率得到1点怒气。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 134952,
					["ranks"] = 5,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "坚韧",
					["tips"] = "使你因装备而获得的护甲值提高2%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 135892,
					["ranks"] = 5,
				},
			}, -- [5]
			{
				["info"] = {
					["tips"] = "激活之后，使你暂时获得相当于最大生命值30%的生命值，持续20秒。在效果解除之后，这些生命值会被扣除。",
					["name"] = "破釜沉舟",
					["row"] = 3,
					["column"] = 1,
					["exceptional"] = 1,
					["icon"] = 135871,
					["ranks"] = 1,
				},
			}, -- [6]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 2,
							["source"] = 4,
						}, -- [1]
					},
					["name"] = "强化盾牌格挡",
					["tips"] = "使你的盾牌格档技能可以额外格档一次攻击，并使其有效时间延长1秒。",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 132110,
					["ranks"] = 1,
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "强化复仇",
					["tips"] = "使你的复仇技能有15%的几率令目标昏迷3秒。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 132353,
					["ranks"] = 3,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "挑衅",
					["tips"] = "使你在防御姿态下由于攻击而造成的威胁值提高5%，并使你的精准等级提高2。",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 132347,
					["ranks"] = 3,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化破甲攻击",
					["tips"] = "使你的破甲攻击和毁灭打击所消耗的怒气值减少1点。",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 132363,
					["ranks"] = 3,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "强化缴械",
					["tips"] = "使你的缴械技能的效果持续时间延长1秒。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 132343,
					["ranks"] = 3,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "强化嘲讽",
					["tips"] = "使你的嘲讽技能的冷却时间减少1秒。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 136080,
					["ranks"] = 2,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "强化盾墙",
					["tips"] = "使你的盾墙技能的有效时间延长3秒。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 132362,
					["ranks"] = 2,
				},
			}, -- [13]
			{
				["info"] = {
					["tips"] = "野蛮的攻击，令目标昏迷5秒。",
					["name"] = "震荡猛击",
					["row"] = 5,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132325,
					["ranks"] = 1,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "强化盾击",
					["tips"] = "使你的盾击技能有50%的几率使目标沉默3秒。",
					["column"] = 3,
					["row"] = 5,
					["icon"] = 132357,
					["ranks"] = 2,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "盾牌掌握",
					["tips"] = "使你的盾牌所吸收的伤害值提高10%。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 132360,
					["ranks"] = 3,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "单手武器专精",
					["tips"] = "在你装备单手近战武器时，使你的物理伤害提高2%。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 135321,
					["ranks"] = 5,
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "强化防御姿态",
					["tips"] = "在防御姿态下受到的所有法术伤害减少2%。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 132341,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["tips"] = "用盾牌击打目标，对其造成225到235点伤害（盾牌格档值会对伤害数值产生影响），并驱散目标身上的1个魔法效果，同时产生大量的威胁值。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "盾牌猛击",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 134951,
					["ranks"] = 1,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "怒火专注",
					["tips"] = "使你的所有攻击技能所消耗的怒气值降低1。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 132345,
					["ranks"] = 3,
				},
			}, -- [20]
			{
				["info"] = {
					["name"] = "活力",
					["tips"] = "使你的耐力总值提高1%，力量总值提高2%。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 133123,
					["ranks"] = 5,
				},
			}, -- [21]
			{
				["info"] = {
					["tips"] = "击碎目标的护甲，对其造成破甲效果。另外还可以造成50%的武器伤害，外加目标身上每层破甲效果所提供的15点伤害加成。破甲效果可以叠加最多5次。",
					["name"] = "毁灭打击",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 135291,
					["ranks"] = 1,
				},
			}, -- [22]
		},
		["info"] = {
			["name"] = "防护",
			["background"] = "WarriorProtection",
		},
	}, -- [3]
}
Talented_Data_PALADIN = {
	{
		["numtalents"] = 20,
		["talents"] = {
			{
				["info"] = {
					["name"] = "神圣之力",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132154,
					["row"] = 1,
					["tips"] = "使你的力量总值提高2%。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "神圣智慧",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136090,
					["row"] = 1,
					["tips"] = "使你的智力总值提高2%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "精神集中",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135736,
					["row"] = 2,
					["tips"] = "使你的圣光闪现和圣光术有14%的几率在受到伤害时不会延长施法时间。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化正义圣印",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132325,
					["row"] = 2,
					["tips"] = "使你的正义圣印和正义审判的伤害提高3%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "治疗之光",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135920,
					["row"] = 3,
					["tips"] = "使你的圣光术和圣光闪现的治疗效果提高4%。",
				},
			}, -- [5]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "光环掌握",
					["icon"] = 135872,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "使你的光环的影响半径扩大到40码。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化圣疗术",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 135928,
					["row"] = 3,
					["tips"] = "被你的圣疗术治疗的目标因装备而获得的护甲值提高15%，持续2分钟。另外，圣疗术的冷却时间减少10分钟。",
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "不灭信仰",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 135984,
					["row"] = 3,
					["tips"] = "使你抵抗恐惧和困惑效果的几率提高5%。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "启发",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135913,
					["row"] = 4,
					["tips"] = "在你的圣光闪现、圣光术或神圣震击治疗法术造成爆击效果后，使你有20%的几率恢复施放该法术所需基础法力值的60%。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化智慧祝福",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 135970,
					["row"] = 4,
					["tips"] = "使你的智慧祝福的效果提高10%。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "纯净心灵",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135948,
					["row"] = 5,
					["tips"] = "使你抵抗诅咒和疾病效果的几率提高5%。",
				},
			}, -- [11]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 4,
							["source"] = 9,
						}, -- [1]
					},
					["name"] = "神恩术",
					["icon"] = 135915,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "激活之后，使你的下一个圣光闪现、圣光术或神圣震击有100%的爆击几率。",
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "神圣光芒",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135917,
					["row"] = 5,
					["tips"] = "使你的圣光术的爆击几率提高2%。",
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "净化之力",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135950,
					["row"] = 6,
					["tips"] = "使你的清洁术、纯净术和奉献法术所消耗的法力值减少5%，驱邪术和神圣愤怒的爆击几率提高10%。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "神圣能量",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135938,
					["row"] = 6,
					["tips"] = "使你的神圣法术造成爆击的几率提高1%。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "光之优雅",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135931,
					["row"] = 7,
					["tips"] = "使你施放的圣光术有33%的几率令下一个圣光术的施法时间减少0.5秒，该效果可持续15秒。",
				},
			}, -- [16]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 12,
						}, -- [1]
					},
					["name"] = "神圣震击",
					["icon"] = 135972,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "以神圣的能量冲击目标，造成277到299点神圣伤害，或为盟友恢复351到379点生命值。",
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "神佑之体",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135876,
					["row"] = 7,
					["tips"] = "你有4%的几率在受到任何攻击时只承受一半的伤害。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "神圣指引",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135921,
					["row"] = 8,
					["tips"] = "使你的法术伤害和治疗效果提高，数值相当于你的智力总值的7%。",
				},
			}, -- [19]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "神启",
					["icon"] = 135895,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "使你的所有法术所消耗的法力值减少50%，持续15秒。",
				},
			}, -- [20]
		},
		["info"] = {
			["name"] = "神圣",
			["background"] = "PaladinHoly",
		},
	}, -- [1]
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化虔诚光环",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135893,
					["row"] = 1,
					["tips"] = "使你的虔诚光环提供额外护甲值的效果增强8%。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "盾牌壁垒",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132110,
					["row"] = 1,
					["tips"] = "使你在受到近战和远程伤害之后有10%的几率获得盾牌格挡几率提高6%的效果。持续10秒或格挡5次攻击。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "精确",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132282,
					["row"] = 2,
					["tips"] = "使你的近战武器和法术命中几率提高1%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "守护者的宠爱",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 135964,
					["row"] = 2,
					["tips"] = "使你的保护祝福的冷却时间减少60秒，自由祝福的效果持续时间延长2秒。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "坚韧",
					["ranks"] = 5,
					["column"] = 4,
					["icon"] = 135892,
					["row"] = 2,
					["tips"] = "使你因装备而获得的护甲值提高2%。",
				},
			}, -- [5]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "王者祝福",
					["icon"] = 135995,
					["column"] = 1,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "为友方目标施加祝福，使其所有属性提高10%，持续10分钟。每个圣骑士在同一时间内只能给目标施加一种祝福，同类型的祝福不能重叠。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化正义之怒",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135962,
					["row"] = 3,
					["tips"] = "当正义之怒处于激活状态时，你所承受的一切伤害降低2%，正义之怒所产生的威胁值提高16%。",
				},
			}, -- [7]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 1,
							["source"] = 2,
						}, -- [1]
					},
					["name"] = "盾牌专精",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 134952,
					["row"] = 3,
					["tips"] = "使你的盾牌所能吸收的伤害提高10%。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "预知",
					["ranks"] = 5,
					["column"] = 4,
					["icon"] = 135994,
					["row"] = 3,
					["tips"] = "使你的防御技能提高4点。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "淡泊",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135978,
					["row"] = 4,
					["tips"] = "使你抵抗昏迷效果的几率提高5%，你的法术被驱散的几率降低15%。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "强化制裁之锤",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135963,
					["row"] = 4,
					["tips"] = "使你的制裁之锤的冷却时间减少5秒。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "强化专注光环",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135933,
					["row"] = 4,
					["tips"] = "使你的专注光环的效果提高5%，所有受到光环影响的队友受到沉默和打断效果影响的时间缩短10%。影响时间缩短的效果不与其它同类效果叠加。",
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "法术屏障",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135925,
					["row"] = 5,
					["tips"] = "使你受到的所有法术伤害降低2%。",
				},
			}, -- [13]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "庇护祝福",
					["icon"] = 136051,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "为友方目标施加祝福，使其所受到的所有类型的伤害都减少最多10点，持续10分钟。另外，当目标格挡一次近战攻击时，攻击者会受到14点神圣伤害。每个圣骑士在同一时间内只能给目标施加一种祝福，同类型的祝福不能重叠。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "清算",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135882,
					["row"] = 5,
					["tips"] = "使你在承受任何攻击伤害之后有2%的几率在接下来的8秒内进行的4次武器攻击获得一次额外的攻击机会。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "神圣使命",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135896,
					["row"] = 6,
					["tips"] = "使你的耐力总值提高3%，圣盾术的冷却时间减少30秒，攻击速度惩罚降低50%。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "单手武器专精",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135321,
					["row"] = 6,
					["tips"] = "使你在持有单手近战武器时造成的所有伤害提高1%。",
				},
			}, -- [17]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "强化神圣之盾",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135880,
					["row"] = 7,
					["tips"] = "使你的神圣之盾造成的伤害提高10%，神圣之盾的使用次数增加2次。",
				},
			}, -- [18]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "神圣之盾",
					["icon"] = 135880,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "使你的格挡几率提高30%，持续10秒。在此期间每次成功格挡都会对攻击者造成59点神圣伤害，由神圣之盾造成的伤害所产生的威胁值提高35%。每次成功格挡会消耗掉一次格挡机会，最多可格挡4次。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "炽热防御者",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135870,
					["row"] = 7,
					["tips"] = "当你的生命值低于35%时，你承受的所有伤害降低6%。",
				},
			}, -- [20]
			{
				["info"] = {
					["name"] = "战斗精准",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135986,
					["row"] = 8,
					["tips"] = "使你的精准等级提高1，耐力总值提高2%。",
				},
			}, -- [21]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "复仇者之盾",
					["icon"] = 135874,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "向目标投掷神圣之盾，对其造成270到330点神圣伤害并使其眩晕，然后跳转攻击下一个附近的目标。最多可攻击3个目标。效果持续6秒。",
				},
			}, -- [22]
		},
		["info"] = {
			["name"] = "防护",
			["background"] = "PaladinProtection",
		},
	}, -- [2]
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化力量祝福",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135906,
					["row"] = 1,
					["tips"] = "使你的力量祝福所提供的攻击强度加成提高4%。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "祈福",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135863,
					["row"] = 1,
					["tips"] = "使你的审判和圣印所消耗的法力值减少3%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "强化审判",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135959,
					["row"] = 2,
					["tips"] = "使你的审判法术的冷却时间减少1秒。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化十字军圣印",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135924,
					["row"] = 2,
					["tips"] = "除了普通的效果外，你的十字军审判也会令所有攻击对审判目标的爆击几率提高1%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "偏斜",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132269,
					["row"] = 2,
					["tips"] = "使你的招架几率提高1%。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "辩护",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135985,
					["row"] = 3,
					["tips"] = "使圣骑士的近战攻击有一定的几率令目标的属性降低5%，持续15秒。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "定罪",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135957,
					["row"] = 3,
					["tips"] = "使你用近战武器对敌人造成爆击的几率提高1%。",
				},
			}, -- [7]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "命令圣印",
					["icon"] = 132347,
					["column"] = 3,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "使圣骑士在攻击时有一定几率对目标造成与攻击伤害的70%等量的神圣伤害。圣骑士在同一时间内只能激活一种圣印。持续30秒。\r\n\r\n释放这种圣印的能量将对目标造成审判效果，对其立刻造成54到59点神圣伤害，若目标昏迷或瘫痪则造成109到118点神圣伤害。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "正义追击",
					["ranks"] = 3,
					["column"] = 4,
					["icon"] = 135937,
					["row"] = 3,
					["tips"] = "使你被法术命中的几率降低5%，移动速度和坐骑移动速度提高5%。这个效果不与其它同类效果叠加。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "以眼还眼",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135904,
					["row"] = 4,
					["tips"] = "所有对你造成爆击的法术都会对其施法者造成15%的伤害，但最大数值不会超过圣骑士生命值总量的50%。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "强化惩罚光环",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 135873,
					["row"] = 4,
					["tips"] = "使你的惩戒光环的伤害提高25%。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "征伐",
					["ranks"] = 3,
					["column"] = 4,
					["icon"] = 135889,
					["row"] = 4,
					["tips"] = "对人形生物、恶魔、亡灵和元素生物造成的所有伤害提高1%。",
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "双手武器专精",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 133041,
					["row"] = 5,
					["tips"] = "使你的双手近战武器伤害提高2%。",
				},
			}, -- [13]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "圣洁光环",
					["icon"] = 135934,
					["column"] = 3,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "使半径30码范围内的队友的神圣系攻击对敌人造成的伤害提高10%。每个圣骑士在同一时间内只能开启一种光环，且同类光环的效果无法叠加。",
				},
			}, -- [14]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "强化圣洁光环",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 135934,
					["row"] = 5,
					["tips"] = "受到圣洁光环影响的目标所能造成的伤害提高1%。",
				},
			}, -- [15]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 3,
							["source"] = 7,
						}, -- [1]
					},
					["name"] = "复仇",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132275,
					["row"] = 6,
					["tips"] = "使你的武器攻击、法术或技能在对敌人造成爆击之后有1%的物理和神圣伤害加成，持续30秒。这个效果可以叠加最多3次。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "神圣审判",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135959,
					["row"] = 6,
					["tips"] = "你的审判法术有33%的几率返还所用圣印的法力值消耗的80%。",
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "神圣圣印",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135924,
					["row"] = 7,
					["tips"] = "你的所有法术和近战攻击的爆击几率提高1%，你的圣印被驱散的几率降低33%。",
				},
			}, -- [18]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "忏悔",
					["icon"] = 135942,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "使目标进入冥想状态，最多持续6秒。任何伤害都会唤醒目标。只对人型生物有效。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "神圣意志",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135897,
					["row"] = 7,
					["tips"] = "近战和远程爆击对你所造成的伤害降低4%。",
				},
			}, -- [20]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "狂热",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135905,
					["row"] = 8,
					["tips"] = "所有可以造成爆击的审判法术的爆击几率提高3%，所有行为造成的威胁值降低6%（在正义之怒效果影响下时不会降低威胁值）。",
				},
			}, -- [21]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "十字军打击",
					["icon"] = 135891,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "瞬发的攻击，可以对目标造成110%的武器伤害，并刷新目标身上的所有审判持续时间。",
				},
			}, -- [22]
		},
		["info"] = {
			["name"] = "惩戒",
			["background"] = "PaladinCombat",
		},
	}, -- [3]
}
Talented_Data_MAGE = {
	{
		["numtalents"] = 23,
		["talents"] = {
			{
				["info"] = {
					["tips"] = "使你的目标对你的所有法术的抗性降低5点，并使你的奥术系法术所造成的威胁值降低20%。",
					["name"] = "奥术精妙",
					["column"] = 1,
					["row"] = 1,
					["icon"] = 135894,
					["ranks"] = 2,
				},
			}, -- [1]
			{
				["info"] = {
					["tips"] = "使你的敌人抵抗你的奥术魔法的几率降低2%。",
					["name"] = "奥术集中",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 135892,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["tips"] = "使你有20%的几率在施放奥术飞弹时不会因为受到伤害而中断施法。",
					["name"] = "强化奥术飞弹",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 136096,
					["ranks"] = 5,
				},
			}, -- [3]
			{
				["info"] = {
					["tips"] = "使你的魔杖伤害提高13%。",
					["name"] = "魔杖专精",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 135463,
					["ranks"] = 2,
				},
			}, -- [4]
			{
				["info"] = {
					["tips"] = "使你的所有抗性提高2点，你每次完全抵抗一个法术就可以恢复法力值总量的1%。冷却时间1秒钟。",
					["name"] = "魔法吸收",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 136011,
					["ranks"] = 5,
				},
			}, -- [5]
			{
				["info"] = {
					["tips"] = "使你有2%的几率在任何伤害法术命中目标之后进入节能施法状态。节能施法状态可以使你的下一个伤害性法术所消耗的法力值减少100%。",
					["name"] = "奥术专注",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 136170,
					["ranks"] = 5,
				},
			}, -- [6]
			{
				["info"] = {
					["tips"] = "使你的魔法抑制和魔法增效的效果提高25%。",
					["name"] = "魔法协调",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 136006,
					["ranks"] = 2,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "使你的魔爆术和奥术冲击的爆击几率提高2%。",
					["name"] = "奥术冲撞",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 136116,
					["ranks"] = 3,
				},
			}, -- [8]
			{
				["info"] = {
					["tips"] = "使你的护甲值提高，数值相当于你的智力值的100%。",
					["name"] = "奥术坚韧",
					["exceptional"] = 1,
					["column"] = 4,
					["row"] = 3,
					["icon"] = 135733,
					["ranks"] = 1,
				},
			}, -- [9]
			{
				["info"] = {
					["tips"] = "使你的法力护盾每吸收一点伤害所消耗的法力值减少10%。",
					["name"] = "强化法力护盾",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 136153,
					["ranks"] = 2,
				},
			}, -- [10]
			{
				["info"] = {
					["tips"] = "使你的法术反制有50%的几率使目标沉默4秒。",
					["name"] = "强化法术反制",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 135856,
					["ranks"] = 2,
				},
			}, -- [11]
			{
				["info"] = {
					["tips"] = "使你在施法时仍保持10%的法力恢复速度。",
					["name"] = "奥术冥想",
					["column"] = 4,
					["row"] = 4,
					["icon"] = 136208,
					["ranks"] = 3,
				},
			}, -- [12]
			{
				["info"] = {
					["tips"] = "在施放闪现法术之后的4秒内，你被任何攻击命中的几率降低13%。",
					["name"] = "强化闪现术",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 135736,
					["ranks"] = 2,
				},
			}, -- [13]
			{
				["info"] = {
					["tips"] = "激活之后，你的下一个施法时间低于10秒的法师法术会成为瞬发法术。",
					["name"] = "气定神闲",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 5,
					["icon"] = 136031,
					["ranks"] = 1,
				},
			}, -- [14]
			{
				["info"] = {
					["tips"] = "使你的智力总值提高3%。",
					["name"] = "奥术心智",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 136129,
					["ranks"] = 5,
				},
			}, -- [15]
			{
				["info"] = {
					["tips"] = "受到的所有伤害降低2%。",
					["name"] = "多彩屏障",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 135752,
					["ranks"] = 2,
				},
			}, -- [16]
			{
				["info"] = {
					["tips"] = "使你的法术伤害和爆击几率提高1%。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "奥术增效",
					["column"] = 2,
					["row"] = 6,
					["icon"] = 136222,
					["ranks"] = 3,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "在节能施法状态下施放的所有法术的爆击几率提高10%。",
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 2,
							["source"] = 6,
						}, -- [1]
					},
					["name"] = "奥术潜能",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 135732,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["tips"] = "提高法术伤害的效果对你的奥术飞弹有15%的额外加成，但法力值消耗提高2%。",
					["name"] = "奥术飞弹增效",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 136096,
					["ranks"] = 3,
				},
			}, -- [19]
			{
				["info"] = {
					["tips"] = "激活之后，你的法术会造成30%的额外伤害，但同时也要消耗30%的额外法力才能施放。这个效果可以持续15秒。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 6,
							["source"] = 17,
						}, -- [1]
					},
					["name"] = "奥术强化",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 7,
					["icon"] = 136048,
					["ranks"] = 1,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "所有法术的爆击伤害加成提高25%。",
					["name"] = "法术能量",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 135734,
					["ranks"] = 2,
				},
			}, -- [21]
			{
				["info"] = {
					["tips"] = "使你的法术伤害加成提高，数值最多相当于你的智力总值的5%。",
					["name"] = "心灵掌握",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 135740,
					["ranks"] = 5,
				},
			}, -- [22]
			{
				["info"] = {
					["tips"] = "使目标的移动速度降低50%，远程攻击间隔延长50%，施法时间延长50%，持续15秒。同一时间内只能对一个目标使用减速。",
					["name"] = "减速",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 9,
					["icon"] = 136091,
					["ranks"] = 1,
				},
			}, -- [23]
		},
		["info"] = {
			["background"] = "MageArcane",
			["name"] = "奥术",
		},
	}, -- [1]
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["tips"] = "使你的火球术的施法时间减少0.1秒。",
					["name"] = "强化火球术",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 135812,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["tips"] = "使你的火焰魔法有2%的几率令目标昏迷2秒。",
					["name"] = "冲击",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 135821,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["tips"] = "你的火焰法术在造成爆击后使目标燃烧，令其在4秒内承受相当于该法术伤害8%的额外伤害。",
					["name"] = "点燃",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 135818,
					["ranks"] = 5,
				},
			}, -- [3]
			{
				["info"] = {
					["tips"] = "使你的火焰法术的射程增加3码。",
					["name"] = "烈焰投掷",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 135815,
					["ranks"] = 2,
				},
			}, -- [4]
			{
				["info"] = {
					["tips"] = "使你的火焰冲击的冷却时间减少0.5秒。",
					["name"] = "强化火焰冲击",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 135807,
					["ranks"] = 3,
				},
			}, -- [5]
			{
				["info"] = {
					["tips"] = "使你的火焰冲击和灼烧法术的爆击率提高2%。",
					["name"] = "烧尽",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 135813,
					["ranks"] = 2,
				},
			}, -- [6]
			{
				["info"] = {
					["tips"] = "使你的烈焰风暴造成爆击的几率提高5%。",
					["name"] = "强化烈焰风暴",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 135826,
					["ranks"] = 3,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "发射一枚巨大的火球，对目标造成141到187点火焰伤害，并在12秒内造成总计56点额外伤害。",
					["name"] = "炎爆术",
					["exceptional"] = 1,
					["column"] = 3,
					["row"] = 3,
					["icon"] = 135808,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["tips"] = "使你的火焰系法术有35%的几率不会因为你受到伤害而被干扰，火焰系法术所造成的威胁值降低5%。",
					["name"] = "燃烧之魂",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 135805,
					["ranks"] = 2,
				},
			}, -- [9]
			{
				["info"] = {
					["tips"] = "使你的灼烧法术有33%的几率令目标更易受到火焰伤害，在其受到火焰系攻击时承受的伤害提高3%，持续30秒。可叠加5次。",
					["name"] = "强化灼烧",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 135827,
					["ranks"] = 3,
				},
			}, -- [10]
			{
				["info"] = {
					["tips"] = "你的防护火焰结界有10%的几率将火焰法术反射给施法者。另外，你的熔岩护甲有50%的几率对远程或法术攻击生效。",
					["name"] = "熔岩护盾",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 135806,
					["ranks"] = 2,
				},
			}, -- [11]
			{
				["info"] = {
					["tips"] = "使你的火焰系和冰霜系法术在造成爆击效果之后为施法者回复该法术所消耗基础法力值的10%。",
					["name"] = "元素大师",
					["column"] = 4,
					["row"] = 4,
					["icon"] = 135820,
					["ranks"] = 3,
				},
			}, -- [12]
			{
				["info"] = {
					["tips"] = "使你所造成的法术伤害提高1%，受到的所有法术伤害提高1%。",
					["name"] = "玩火自焚",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 135823,
					["ranks"] = 3,
				},
			}, -- [13]
			{
				["info"] = {
					["tips"] = "使你的火焰法术造成爆击的几率提高2%。",
					["name"] = "火焰重击",
					["column"] = 2,
					["row"] = 5,
					["icon"] = 136115,
					["ranks"] = 3,
				},
			}, -- [14]
			{
				["info"] = {
					["tips"] = "施法者放出一道火焰冲击波，所有被冲击波触及的敌人都会受到154到186点火焰伤害并眩晕6秒。",
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 8,
						}, -- [1]
					},
					["name"] = "冲击波",
					["exceptional"] = 1,
					["column"] = 3,
					["row"] = 5,
					["icon"] = 135903,
					["ranks"] = 1,
				},
			}, -- [15]
			{
				["info"] = {
					["tips"] = "使你有5%的几率在受到近战或远程攻击之后，移动速度提高50%，并解除所有移动限制效果。炽热疾速效果可持续8秒。",
					["name"] = "炽热疾速",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 135788,
					["ranks"] = 2,
				},
			}, -- [16]
			{
				["info"] = {
					["tips"] = "使你的火焰法术的伤害提高2%。",
					["name"] = "火焰强化",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 135817,
					["ranks"] = 5,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "使所有火焰法术的爆击几率提高1%，法力值消耗降低1%。",
					["name"] = "纵火",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 135789,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["tips"] = "激活之后，你每一次施放火焰系伤害性法术，你的该类法术的爆击几率都会提高10%。这个效果会一直持续到你使用火焰系法术造成了3次爆击。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "燃烧",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 7,
					["icon"] = 135824,
					["ranks"] = 1,
				},
			}, -- [19]
			{
				["info"] = {
					["tips"] = "所有法术对生命值低于20%的目标所造成的伤害提高10%。",
					["name"] = "熔岩之怒",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 135822,
					["ranks"] = 2,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "提高法术伤害的效果对你的火球术有3%的额外加成。",
					["name"] = "火球增效",
					["column"] = 3,
					["row"] = 8,
					["icon"] = 135812,
					["ranks"] = 5,
				},
			}, -- [21]
			{
				["info"] = {
					["tips"] = "施法者面前一个锥形区域内的敌人受到370到430点火焰伤害，并陷入混乱状态，持续3秒。任何直接伤害型的攻击都会令混乱的目标恢复正常。使用之后结束你的攻击动作。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "龙息术",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 9,
					["icon"] = 134153,
					["ranks"] = 1,
				},
			}, -- [22]
		},
		["info"] = {
			["background"] = "MageFire",
			["name"] = "火焰",
		},
	}, -- [2]
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["tips"] = "使你的霜甲术和冰甲术所提供的护甲值和抗性提高15%。另外，你的防护冰霜结界有10%的几率将冰霜系法术和魔法效果反射给施法者。",
					["name"] = "冰霜障壁",
					["column"] = 1,
					["row"] = 1,
					["icon"] = 135850,
					["ranks"] = 2,
				},
			}, -- [1]
			{
				["info"] = {
					["tips"] = "使你的寒冰箭的施法时间减少0.1秒。",
					["name"] = "强化寒冰箭",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 135846,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["tips"] = "使你的火焰和冰霜系法术所消耗的法力值及目标抵抗这些法术的几率降低1%。",
					["name"] = "元素精准",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 135989,
					["ranks"] = 3,
				},
			}, -- [3]
			{
				["info"] = {
					["tips"] = "使你的冰霜法术爆击所造成的伤害提高20%。",
					["name"] = "寒冰碎片",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 135855,
					["ranks"] = 5,
				},
			}, -- [4]
			{
				["info"] = {
					["tips"] = "使你的寒冷效果有5%的几率将目标冰冻5秒。",
					["name"] = "霜寒刺骨",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 135842,
					["ranks"] = 3,
				},
			}, -- [5]
			{
				["info"] = {
					["tips"] = "使你的冰霜新星的冷却时间减少2秒。",
					["name"] = "强化冰霜新星",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 135840,
					["ranks"] = 2,
				},
			}, -- [6]
			{
				["info"] = {
					["tips"] = "使你的冰冷效果的持续时间延长1秒，并使目标身上的减速效果提高4%。",
					["name"] = "极寒冰霜",
					["column"] = 4,
					["row"] = 2,
					["icon"] = 135864,
					["ranks"] = 3,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "使你的冰霜法术的伤害提高2%。",
					["name"] = "刺骨寒冰",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 135845,
					["ranks"] = 3,
				},
			}, -- [8]
			{
				["info"] = {
					["tips"] = "提高你的施法速度，使得所有法术的施法速度提高20%，避免因受到伤害而打断施法的几率提高100%，效果持续20秒。",
					["name"] = "冰冷血脉",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 3,
					["icon"] = 135838,
					["ranks"] = 1,
				},
			}, -- [9]
			{
				["info"] = {
					["tips"] = "为你的暴风雪法术增加冰冷效果，使目标的移动速度降低30%,持续1.50秒。",
					["name"] = "强化暴风雪",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 135857,
					["ranks"] = 3,
				},
			}, -- [10]
			{
				["info"] = {
					["tips"] = "使你的冰霜新星和冰锥术的有效半径以及寒冰箭、冰枪术和暴风雪的射程提高10%。",
					["name"] = "极寒延伸",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 136141,
					["ranks"] = 2,
				},
			}, -- [11]
			{
				["info"] = {
					["tips"] = "使你的所有冰霜法术所消耗的法力值减少5%，冰霜系法术所造成的威胁值降低4%。",
					["name"] = "冰霜导能",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 135860,
					["ranks"] = 3,
				},
			}, -- [12]
			{
				["info"] = {
					["tips"] = "使你的所有法术在击中被冰冻的敌人时造成爆击的几率提高10%。",
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 2,
							["source"] = 6,
						}, -- [1]
					},
					["name"] = "碎冰",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 135849,
					["ranks"] = 5,
				},
			}, -- [13]
			{
				["info"] = {
					["tips"] = "受到冰霜和火焰系攻击时所承受的伤害降低2%。",
					["name"] = "冰冻之心",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 135851,
					["ranks"] = 3,
				},
			}, -- [14]
			{
				["info"] = {
					["tips"] = "激活之后，使你的所有冰霜法术的冷却时间结束。",
					["name"] = "急速冷却",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 5,
					["icon"] = 135865,
					["ranks"] = 1,
				},
			}, -- [15]
			{
				["info"] = {
					["tips"] = "使你的冰锥术的伤害提高15%。",
					["name"] = "强化冰锥术",
					["column"] = 3,
					["row"] = 5,
					["icon"] = 135852,
					["ranks"] = 3,
				},
			}, -- [16]
			{
				["info"] = {
					["tips"] = "使你的冰锥术、急速冷却、寒冰护体和寒冰屏障法术的冷却时间减少10%。",
					["name"] = "浮冰",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 135854,
					["ranks"] = 2,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "你的冰霜系伤害法术有20%的几率附加深冬之寒效果，令冰霜系法术对目标造成爆击的几率提高2%，效果持续15秒，可叠加最多5次。",
					["name"] = "深冬之寒",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 135836,
					["ranks"] = 5,
				},
			}, -- [18]
			{
				["info"] = {
					["tips"] = "立即为目标加上魔法护盾，可吸收438点伤害，持续1分钟。只要护盾存在，受保护者的施法就不会被打断。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 15,
						}, -- [1]
					},
					["name"] = "寒冰护体",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 7,
					["icon"] = 135988,
					["ranks"] = 1,
				},
			}, -- [19]
			{
				["info"] = {
					["tips"] = "使你的所有冰霜法术伤害提高1%，被近战和远程攻击命中的几率降低1%。",
					["name"] = "极寒之风",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 135833,
					["ranks"] = 5,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "提高法术伤害的效果对你的寒冰箭有2%的额外加成，同时你的寒冰箭的爆击几率提高1%。",
					["name"] = "寒冰箭增效",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 135846,
					["ranks"] = 5,
				},
			}, -- [21]
			{
				["info"] = {
					["tips"] = "召唤一个水元素为施法者作战，持续45秒。",
					["name"] = "召唤水元素",
					["exceptional"] = 1,
					["column"] = 2,
					["row"] = 9,
					["icon"] = 135862,
					["ranks"] = 1,
				},
			}, -- [22]
		},
		["info"] = {
			["background"] = "MageFrost",
			["name"] = "冰霜",
		},
	}, -- [3]
}
Talented_Data_PRIEST = {
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["name"] = "坚定意志",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135995,
					["row"] = 1,
					["tips"] = "使你抵抗昏迷、恐惧和沉默效果的几率提高3%。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "魔杖专精",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135463,
					["row"] = 1,
					["tips"] = "使你的魔杖伤害提高5%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "无声消退",
					["ranks"] = 5,
					["column"] = 1,
					["icon"] = 136053,
					["row"] = 2,
					["tips"] = "使你的神圣和戒律系法术造成的威胁值降低4%，并使你的法术被驱散的几率降低4%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化真言术：韧",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 135987,
					["row"] = 2,
					["tips"] = "使你的真言术：韧和坚韧祷言的效果提高15%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "强化真言术：盾",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135940,
					["row"] = 2,
					["tips"] = "使你的真言术：盾所吸收的伤害提高5%。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "殉难",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 136107,
					["row"] = 2,
					["tips"] = "使你有50%的几率在受到敌人的近战或远程爆击后获得专注施法效果，持续6秒。专注施法效果可以令你避免因为受到伤害而延长牧师法术的施法时间，并使你抵抗打断效果的几率提高10%。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "赦免",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135868,
					["row"] = 3,
					["tips"] = "使你的驱散魔法、治愈疾病、驱除疾病和群体驱散法术所消耗的法力值降低5%。",
				},
			}, -- [7]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "心灵专注",
					["icon"] = 135863,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "激活之后，你的下一个法术所消耗的法力值减少100%，爆击几率提高25%（如果它有可能造成爆击的话）。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "冥想",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 136090,
					["row"] = 3,
					["tips"] = "使你在施法时仍保持10%的法力值恢复速度。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化心灵之火",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135926,
					["row"] = 4,
					["tips"] = "使你的心灵之火的护甲增强效果提高10%。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "精神敏锐",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132156,
					["row"] = 4,
					["tips"] = "使你的瞬发法术所消耗的法力值减少2%。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "强化法力燃烧",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 136170,
					["row"] = 4,
					["tips"] = "使你的法力燃烧的施法时间减少0.5秒。",
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "心灵之力",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 136031,
					["row"] = 5,
					["tips"] = "使你的法力值上限提高2%。",
				},
			}, -- [13]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 9,
						}, -- [1]
					},
					["name"] = "神圣之灵",
					["icon"] = 135898,
					["column"] = 3,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "圣洁的能量充满目标全身，令其精神提高17点，持续30分钟。",
				},
			}, -- [14]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "强化神圣之灵",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 135898,
					["row"] = 5,
					["tips"] = "你的神圣之灵和精神祷言法术令目标的法术伤害和治疗效果提高，数值相当于他们各自精神总值的5%。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "能量集中",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 136158,
					["row"] = 6,
					["tips"] = "你的惩击、心灵震爆和群体驱散的命中几率提高2%。另外，你的群体驱散法术的施法时间减少0.5秒。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "意志之力",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136092,
					["row"] = 6,
					["tips"] = "使你的法术伤害提高1%，攻击性法术的爆击几率提高1%。",
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "专注意志",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135737,
					["row"] = 7,
					["tips"] = "在受到爆击之后获得专注意志效果，受到的所有伤害降低2%，受到的治疗效果提高4%，可叠加最多3次。效果持续8秒。",
				},
			}, -- [18]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "能量灌注",
					["icon"] = 135939,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "能量灌注目标全身，使其施法速度提高20%，所有法术的消耗降低20%，持续15秒。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "反射护盾",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135940,
					["row"] = 7,
					["tips"] = "你的真言术：盾所吸收的伤害有10%反射给攻击者。这种伤害不会产生任何威胁值。",
				},
			}, -- [20]
			{
				["info"] = {
					["name"] = "启迪",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135740,
					["row"] = 8,
					["tips"] = "使你的耐力、智力和精神总值提高1%。",
				},
			}, -- [21]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "痛苦压制",
					["icon"] = 135936,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "立即使一个友方目标的威胁值降低5%，受到的所有伤害降低40%，抵抗驱散效果的几率提高65%，效果持续8秒。",
				},
			}, -- [22]
		},
		["info"] = {
			["name"] = "戒律",
			["background"] = "PriestDiscipline",
		},
	}, -- [1]
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "治疗专注",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135918,
					["row"] = 1,
					["tips"] = "使你有35%的几率在施放任何治疗法术时不会因为受到伤害而中断施法。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "强化恢复",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135953,
					["row"] = 1,
					["tips"] = "使你的恢复法术的治疗量提高5%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "神圣专精",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135967,
					["row"] = 1,
					["tips"] = "使你的神圣法术造成爆击的几率提高1%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "法术屏障",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135976,
					["row"] = 2,
					["tips"] = "使你受到的所有法术伤害降低2%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "神圣之怒",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135971,
					["row"] = 2,
					["tips"] = "使你的惩击、神圣之火、治疗术和强效治疗术的施法时间减少0.1秒。",
				},
			}, -- [5]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "神圣新星",
					["icon"] = 135922,
					["column"] = 1,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "制造一次以施法者为中心的神圣能量爆炸，对半径10码范围内的所有目标造成29到34点神圣伤害，并为半径10码范围内的所有小队成员恢复54到63点生命值。这些效果不对怪物产生任何威胁值。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "神恩回复",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135877,
					["row"] = 3,
					["tips"] = "在遭受近战或远程攻击的爆击之后，为你在6秒内恢复相当于该伤害总量8%的生命值。",
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "灵感",
					["ranks"] = 3,
					["column"] = 4,
					["icon"] = 135928,
					["row"] = 3,
					["tips"] = "在你的快速治疗、治疗术、强效治疗术、治疗祷言或治疗之环对目标造成爆击效果后，使目标的护甲值提高8%，持续15秒。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "神圣延伸",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135949,
					["row"] = 4,
					["tips"] = "使你的惩击和神圣之火的射程、治疗祷言、神圣新星和治疗之环的作用半径提高10%。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化治疗术",
					["ranks"] = 3,
					["column"] = 2,
					["icon"] = 135916,
					["row"] = 4,
					["tips"] = "使你的次级治疗术、治疗术和强效治疗术的法力值消耗降低5%。",
				},
			}, -- [10]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 2,
							["source"] = 5,
						}, -- [1]
					},
					["name"] = "灼热之光",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 135973,
					["row"] = 4,
					["tips"] = "使你的惩击和神圣之火的伤害提高5%。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "治疗祈祷",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135943,
					["row"] = 5,
					["tips"] = "使你的治疗祷言和愈合祷言所消耗的法力值减少10%。",
				},
			}, -- [12]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "救赎之魂",
					["icon"] = 132864,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "精神总值提高5%。牧师在死亡之后变身成为救赎之魂，持续15秒。救赎之魂无法移动、攻击、被攻击或被任何法术效果影响。在这个状态下，牧师可以随意施放任何治疗法术。效果结束之后，牧师死亡。",
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "精神指引",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135977,
					["row"] = 5,
					["tips"] = "使你的法术的治疗和伤害效果提高，数值相当于你的精神值的5%。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "圣光涌动",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 135981,
					["row"] = 6,
					["tips"] = "你的法术爆击有25%的几率令你的下一次惩击法术变为瞬发，不消耗法力值，但是无法造成爆击。这个效果可以持续10秒。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "精神治疗",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136057,
					["row"] = 6,
					["tips"] = "使你的治疗法术的治疗效果提高2%。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "神圣专注",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 135905,
					["row"] = 7,
					["tips"] = "使你有2%的几率在施放快速治疗、联结治疗或强效治疗术之后进入节能施法状态。节能施法可以令你的下一个快速治疗、联结治疗或强效治疗术的法力值消耗降低100%。",
				},
			}, -- [17]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "光明之泉",
					["icon"] = 135980,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "在牧师身边制造一个光明之泉。你所属的小队或团队中的友方单位可以点击光明之泉，在6秒内恢复801点生命值。受到伤害会中断这个效果。光明之泉在3分钟或者在被使用5次之后消失。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "神佑之韧",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135878,
					["row"] = 7,
					["tips"] = "你遭受爆击之后有20%的几率在接下来的6秒内不会再受到爆击。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "治疗增效",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135913,
					["row"] = 8,
					["tips"] = "提高法术治疗的效果对你的强效治疗术有4%的额外加成，对你的快速治疗和联结治疗有2%的额外加成。",
				},
			}, -- [20]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "治疗之环",
					["icon"] = 135887,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "治疗友方目标及其身边半径15码范围内的该目标小队成员，恢复250到274点生命值。",
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "神圣",
			["background"] = "PriestHoly",
		},
	}, -- [2]
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "精神分流",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 136188,
					["row"] = 1,
					["tips"] = "使你有20%的几率在杀死一个可以为你提供经验值或荣誉值的目标之后精神属性提高100%。在这段时间里，你的法力值可以在施法时仍保持50%的恢复速度。持续15秒。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "昏阙",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136160,
					["row"] = 1,
					["tips"] = "使你的暗影系伤害性法术有2%的几率令目标昏迷3秒。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "暗影亲和",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 136205,
					["row"] = 2,
					["tips"] = "使你的暗影法术造成的威胁值降低8%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化暗言术：痛",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 136207,
					["row"] = 2,
					["tips"] = "使你的暗言术：痛的持续时间延长3秒。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "暗影集中",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136126,
					["row"] = 2,
					["tips"] = "使目标抵抗你的暗影法术的机率下降2%。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强化心灵尖啸",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 136184,
					["row"] = 3,
					["tips"] = "使你的心灵尖啸的冷却时间减少2秒。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化心灵震爆",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 136224,
					["row"] = 3,
					["tips"] = "使你的心灵震爆的冷却时间减少0.5秒。",
				},
			}, -- [7]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "精神鞭笞",
					["icon"] = 136208,
					["column"] = 3,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "以暗影能量攻击目标的灵魂，在3秒内对其造成总计75点暗影伤害，并使其移动速度降低50%。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "强化渐隐术",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 135994,
					["row"] = 4,
					["tips"] = "使你的渐隐术的冷却时间缩短3秒。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "暗影延伸",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 136130,
					["row"] = 4,
					["tips"] = "使你的暗影系伤害性法术的射程提高10%。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "暗影之波",
					["ranks"] = 5,
					["column"] = 4,
					["icon"] = 136123,
					["row"] = 4,
					["tips"] = "你的暗影系伤害性法术有20%的机会使你的目标在受到暗影系攻击时更脆弱，受到的伤害提高2%，持续15秒。此效果最多可叠加5次。",
				},
			}, -- [11]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 1,
							["row"] = 3,
							["source"] = 6,
						}, -- [1]
					},
					["name"] = "沉默",
					["icon"] = 136164,
					["column"] = 1,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "使目标沉默，在5秒内不能施法。",
				},
			}, -- [12]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "吸血鬼的拥抱",
					["icon"] = 136230,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "暗影魔法的能量笼罩你的目标，使你对其造成的暗影伤害总量的15%转而治疗所有队友，持续1分钟。",
				},
			}, -- [13]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "强化吸血鬼的拥抱",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 136165,
					["row"] = 5,
					["tips"] = "使吸血鬼的拥抱恢复生命值的百分比提高5%。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "心灵集中",
					["ranks"] = 3,
					["column"] = 4,
					["icon"] = 136035,
					["row"] = 5,
					["tips"] = "使你的心灵震爆、精神控制和精神鞭笞所消耗的法力值降低5%。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "暗影之韧",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 136162,
					["row"] = 6,
					["tips"] = "使你受到法术爆击的几率降低2%。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "黑暗",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136223,
					["row"] = 6,
					["tips"] = "使你的暗影法术伤害提高2%。",
				},
			}, -- [17]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "暗影形态",
					["icon"] = 136200,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "进入暗影形态，使你能造成的暗影伤害提高15%，受到物理攻击时承受的伤害降低15%。但是在这个形态下，你不能施放神圣系的法术。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "暗影能量",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136204,
					["row"] = 7,
					["tips"] = "你的心灵震爆和暗言术：灭的爆击几率提高3%。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "悲惨",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136176,
					["row"] = 8,
					["tips"] = "你的暗言术：痛、精神鞭笞和吸血鬼之触会使目标承受的法术伤害提高1%。",
				},
			}, -- [20]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "吸血鬼之触",
					["icon"] = 135978,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "在15秒内对你的目标造成450点暗影伤害，并使所有小队成员获得法力值，数值相当于你所造成的任何暗影伤害的5%。",
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "暗影",
			["background"] = "PriestShadow",
		},
	}, -- [3]
}
Talented_Data_WARLOCK = {
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "镇压",
					["tips"] = "使敌人抵抗你的痛苦系法术的几率降低2%。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136230,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "强化腐蚀术",
					["tips"] = "使你的腐蚀术的施法时间减少0.4秒。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 136118,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "强化虚弱诅咒",
					["tips"] = "使你的虚弱诅咒的效果提高10%。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 136138,
					["ranks"] = 2,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化吸取灵魂",
					["tips"] = "在目标死于你的吸取灵魂过程中时，你将获得你的法力值上限的7%。另外，你的痛苦系法术所产生的威胁值降低5%。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 136163,
					["ranks"] = 2,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "强化生命分流",
					["tips"] = "使你的生命分流法术所转化的法力值提高10%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 136126,
					["ranks"] = 2,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "灵魂虹吸",
					["tips"] = "目标身上每多一层痛苦系法术效果，你的吸取生命所吸取的生命值就提高2%，最多可以获得24%的效果加成。",
					["column"] = 4,
					["row"] = 2,
					["icon"] = 136169,
					["ranks"] = 2,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化痛苦诅咒",
					["tips"] = "使你的痛苦诅咒的伤害提高5%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 136139,
					["ranks"] = 2,
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "恶魔专注",
					["tips"] = "使你有14%的几率在施放吸取生命、吸取法力或吸取灵魂法术时不会因受到伤害而被打断。",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 136157,
					["ranks"] = 5,
				},
			}, -- [8]
			{
				["info"] = {
					["tips"] = "使你的下一个厄运诅咒或痛苦诅咒的效果提高50%，或使你的下一个疲劳诅咒的效果提高20%。持续30秒。",
					["name"] = "诅咒增幅",
					["row"] = 3,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 136132,
					["ranks"] = 1,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "无情延伸",
					["tips"] = "使你的痛苦系法术的射程延长10%。",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 136127,
					["ranks"] = 2,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "夜幕",
					["tips"] = "使你的腐蚀术和吸取生命法术有2%的几率在对敌人造成伤害之后令你进入暗影冥思状态。暗影冥思状可以令你的下一个暗影箭法术的施法时间减少100%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 136223,
					["ranks"] = 2,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "腐蚀增效",
					["tips"] = "提高法术伤害的效果对你的腐蚀术有12%的额外加成。",
					["column"] = 4,
					["row"] = 4,
					["icon"] = 136118,
					["ranks"] = 3,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "暗影之拥",
					["tips"] = "你的腐蚀术、痛苦诅咒、生命虹吸和腐蚀之种也会造成暗影之拥效果，令目标所造成的近战伤害降低1%。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 136198,
					["ranks"] = 5,
				},
			}, -- [13]
			{
				["info"] = {
					["tips"] = "每3秒将目标的15点生命值转移给施法者，持续30秒。",
					["name"] = "生命虹吸",
					["row"] = 5,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136188,
					["ranks"] = 1,
				},
			}, -- [14]
			{
				["info"] = {
					["tips"] = "使目标的速度降低30%，持续12秒。每个术士只能对一个目标施加一种诅咒，且同类诅咒不能叠加。",
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 9,
						}, -- [1]
					},
					["name"] = "疲劳诅咒",
					["row"] = 5,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 136162,
					["ranks"] = 1,
				},
			}, -- [15]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "暗影掌握",
					["tips"] = "使你的暗影法术的伤害或吸取的生命值提高2%。",
					["column"] = 2,
					["row"] = 6,
					["icon"] = 136195,
					["ranks"] = 5,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "传染",
					["tips"] = "使你的痛苦诅咒、腐蚀术和腐蚀之种的伤害提高1%，你的痛苦系法术被驱散的几率降低6%。",
					["column"] = 2,
					["row"] = 7,
					["icon"] = 136180,
					["ranks"] = 5,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "从你的宠物身上抽取305点法力值并全部转化给你。",
					["name"] = "黑暗契约",
					["row"] = 7,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 136141,
					["ranks"] = 1,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "强化恐惧嚎叫",
					["tips"] = "使你的恐惧嚎叫法术的施法时间减少0.8秒。",
					["column"] = 1,
					["row"] = 8,
					["icon"] = 136147,
					["ranks"] = 2,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "邪咒",
					["tips"] = "使你的元素诅咒的伤害加成效果提高1%。",
					["column"] = 3,
					["row"] = 8,
					["icon"] = 136137,
					["ranks"] = 3,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "暗影能量逐渐吞噬目标，在18秒内对其造成总计660点伤害。如果这个效果被驱散，则它对驱散者造成990点伤害，并令其沉默5秒。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 17,
						}, -- [1]
					},
					["name"] = "痛苦无常",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136228,
					["ranks"] = 1,
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "痛苦",
			["background"] = "WarlockCurses",
		},
	}, -- [1]
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化治疗石",
					["tips"] = "使你的治疗石所恢复的生命值增加10%。",
					["column"] = 1,
					["row"] = 1,
					["icon"] = 135230,
					["ranks"] = 2,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "强化小鬼",
					["tips"] = "使小鬼的火焰箭、火焰之盾和血之契印的效果提高10%。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136218,
					["ranks"] = 3,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "恶魔之拥",
					["tips"] = "使你的耐力总值提高3%，同时使你的精神总值降低1%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 136172,
					["ranks"] = 5,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化生命通道",
					["tips"] = "使你的生命通道法术所转化的生命值提高10%，初始生命值消耗减少10%。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 136168,
					["ranks"] = 2,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "强化虚空行者",
					["tips"] = "使你的虚空行者的折磨、吞噬暗影、牺牲和受难法术的效果提高10%。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 136221,
					["ranks"] = 3,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "恶魔智力",
					["tips"] = "使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的智力提高5%，你的法力值上限提高1%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 135932,
					["ranks"] = 3,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化魅魔",
					["tips"] = "使你的魅魔的剧痛鞭笞和安抚之吻法术的效果提高10%，并使你的魅魔的诱惑和次级隐形术的持续时间延长10%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 136220,
					["ranks"] = 3,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "你的下一个召唤小鬼、虚空行者、魅魔、地狱猎犬或恶魔卫士的法术施法时间减少5.5秒，法力消耗减少50%。",
					["name"] = "恶魔支配",
					["row"] = 3,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136082,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "恶魔耐力",
					["tips"] = "使你的小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的生命值上限提高5%，你的生命值上限提高1%。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 136121,
					["ranks"] = 3,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "恶魔庇护",
					["tips"] = "使你的魔甲术和邪甲术的效果提高10%。",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 136185,
					["ranks"] = 3,
				},
			}, -- [10]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 3,
							["source"] = 8,
						}, -- [1]
					},
					["name"] = "召唤大师",
					["tips"] = "使你召唤小鬼、虚空行者、魅魔、地狱猎犬和恶魔卫士的施法时间减少2秒，法力值消耗降低20%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 136164,
					["ranks"] = 2,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "邪恶强化",
					["tips"] = "使你的虚空行者、魅魔、地狱猎犬和恶魔卫士的近战伤害及小鬼的火焰箭伤害提高4%。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 136206,
					["ranks"] = 5,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "强化奴役恶魔",
					["tips"] = "使你的奴役恶魔法术的攻击速度和施法速度惩罚减轻5%，恶魔抵抗奴役效果的几率降低5%。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 136154,
					["ranks"] = 2,
				},
			}, -- [13]
			{
				["info"] = {
					["tips"] = "激活之后，牺牲你当前所召唤的恶魔，使你获得一种特殊效果，持续30分钟。如果在此期间你召唤任意一个恶魔，该效果就会被取消。\r\n\r\n小鬼：使你的火焰技能伤害提高15%。\r\n\r\n虚空行者：使你每4秒回复2%的生命值。\r\n\r\n魅魔：使你的暗影技能伤害提高15%。\r\n\r\n地狱犬：使你每4秒回复3%的法力值。\r\n\r\n恶魔卫士：使你的暗影伤害提高10%，每4秒恢复法力总值的2%。",
					["name"] = "恶魔牺牲",
					["row"] = 5,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136184,
					["ranks"] = 1,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "魔石大师",
					["tips"] = "使你的火焰石的效果和伤害加成提高15%，法术石的法术爆击等级加成提高15%。",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 132386,
					["ranks"] = 2,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "法力喂食",
					["tips"] = "当你因法力吸取或生命分流而获得法力值时，你的宠物也可以获得法力值，数值相当于你所获法力值的33%。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 136171,
					["ranks"] = 3,
				},
			}, -- [16]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 4,
							["source"] = 12,
						}, -- [1]
					},
					["name"] = "恶魔学识大师",
					["tips"] = "使术士和他所召唤的恶魔均获得一个特殊效果，只要该恶魔处于激活状态就不会消失。\r\n\r\n小鬼 - 对敌人造成的威胁降低4%。\r\n\r\n虚空行者 - 受到物理攻击时承受的伤害降低2%。\r\n\r\n魅魔 - 对敌人造成的所有伤害提高2%。\r\n\r\n地狱猎犬 - 每等级所有抗性提高0.2。\r\n\r\n恶魔卫士 - 所有伤害提高1%，所有抗性提高每等级0.1。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 136203,
					["ranks"] = 5,
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "恶魔韧性",
					["tips"] = "使你受到近战和法术爆击的几率降低1%，你所召唤的恶魔受到的所有伤害降低5%。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 136149,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["tips"] = "激活之后，施法者所承受的伤害有20%被他的小鬼、虚空行者、魅魔、地狱猎犬、恶魔卫士或者奴役的恶魔分担。该伤害无法避免。另外，恶魔和其主人的任何攻击所造成的伤害都提高5%。只要恶魔保持激活状态，该效果就一直持续。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "灵魂链接",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136160,
					["ranks"] = 1,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "恶魔知识",
					["tips"] = "使你的法术伤害提高，数值相当于你所激活的恶魔宠物的耐力值与智力值总合的4%。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 136165,
					["ranks"] = 3,
				},
			}, -- [20]
			{
				["info"] = {
					["name"] = "恶魔战术",
					["tips"] = "使你和你所召唤的恶魔宠物的近战和法术爆击几率提高1%。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 136150,
					["ranks"] = 5,
				},
			}, -- [21]
			{
				["info"] = {
					["tips"] = "召唤一个恶魔卫士协助术士作战。",
					["name"] = "召唤恶魔卫士",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136216,
					["ranks"] = 1,
				},
			}, -- [22]
		},
		["info"] = {
			["name"] = "恶魔学识",
			["background"] = "WarlockSummoning",
		},
	}, -- [2]
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化暗影箭",
					["tips"] = "在你的暗影箭对目标造成爆击后，你对其造成的接连4次非持续性暗影伤害都将提高4%。效果持续最多12秒。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136197,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "灾变",
					["tips"] = "使你的毁灭系法术所消耗的法力值减少1%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 135831,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "灾祸",
					["tips"] = "使你的暗影箭和献祭的施法时间减少0.1秒，灵魂之火的施法时间减少0.4秒。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 136146,
					["ranks"] = 5,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "清算",
					["tips"] = "使你的毁灭系法术有2%的几率令目标眩晕5秒。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 135805,
					["ranks"] = 5,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "强化火焰箭",
					["tips"] = "使小鬼的火焰箭的施法时间减少0.25秒。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 135809,
					["ranks"] = 2,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强化剧痛鞭笞",
					["tips"] = "使魅魔的剧痛鞭笞的冷却时间减少3秒。",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 136136,
					["ranks"] = 2,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "毁坏",
					["tips"] = "使你的毁灭系法术的爆击几率提高1%。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 135813,
					["ranks"] = 5,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "立即使用暗影能量冲击目标，对其造成91到104点暗影伤害。如果目标在5秒内死于暗影灼烧，且施法者因此获得经验值或荣誉，则施法者获得一块灵魂碎片。",
					["name"] = "暗影灼烧",
					["row"] = 3,
					["column"] = 4,
					["exceptional"] = 1,
					["icon"] = 136191,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "强烈",
					["tips"] = "使你有35%的几率在施放或引导任何毁灭系法术时不会因受到伤害而被打断。",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 135819,
					["ranks"] = 2,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "毁灭延伸",
					["tips"] = "使你的毁灭系法术的射程增加10%，毁灭系法术所造成的威胁值降低5%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 136133,
					["ranks"] = 2,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "强化灼热之痛",
					["tips"] = "使你的灼热之痛造成爆击的几率提高4%。",
					["column"] = 4,
					["row"] = 4,
					["icon"] = 135827,
					["ranks"] = 3,
				},
			}, -- [11]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 1,
							["row"] = 4,
							["source"] = 9,
						}, -- [1]
					},
					["name"] = "火焰冲撞",
					["tips"] = "使你的火焰之雨、地狱烈焰和灵魂之火有13%的几率使目标昏迷3秒。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 135830,
					["ranks"] = 2,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "强化献祭",
					["tips"] = "使你的献祭法术的初始伤害提高5%。",
					["column"] = 2,
					["row"] = 5,
					["icon"] = 135817,
					["ranks"] = 5,
				},
			}, -- [13]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 7,
						}, -- [1]
					},
					["name"] = "毁灭",
					["tips"] = "使你的毁灭系法术的爆击伤害加成提高100%。",
					["column"] = 3,
					["row"] = 5,
					["icon"] = 136207,
					["ranks"] = 1,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "虚空防护",
					["tips"] = "被暗影或火焰法术击中之后有10%的几率对暗影和火焰法术免疫，效果持续4秒。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 136178,
					["ranks"] = 3,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "灰烬风暴",
					["tips"] = "使你的火焰法术所造成的伤害提高2%，烧尽法术的施法时间减少2%。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 135826,
					["ranks"] = 5,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "反冲",
					["tips"] = "使你的法术爆击几率提高1%，并使你有8%的几率在受到物理攻击之后的下一个暗影箭或燃尽法术的施法时间减少100%。这个效果可以持续8秒，且在8秒内只能出现一次。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 135823,
					["ranks"] = 3,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "点燃一个已经被施加献祭效果的目标，对其造成249到316点火焰伤害并吞噬掉献祭效果。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "燃烧",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 135807,
					["ranks"] = 1,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "灵魂榨取",
					["tips"] = "使你的暗影箭、暗影灼烧、灵魂之火、灼热之痛、烧尽和燃烧有10%的几率为你回复生命值，数值相当于该法术所造成伤害的20%。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 136214,
					["ranks"] = 3,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "暗影烈焰",
					["tips"] = "你的暗影箭和烧尽所获得的法术伤害加成效果提高4%。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 136196,
					["ranks"] = 5,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "释放暗影之怒，对身边半径8码内的所有敌人造成357到422点暗影伤害，并使它们昏迷2秒。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 8,
							["source"] = 20,
						}, -- [1]
					},
					["name"] = "暗影之怒",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136201,
					["ranks"] = 1,
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "毁灭",
			["background"] = "WarlockDestruction",
		},
	}, -- [3]
}
Talented_Data_SHAMAN = {
	{
		["numtalents"] = 20,
		["talents"] = {
			{
				["info"] = {
					["name"] = "传导",
					["tips"] = "使你的震击、闪电箭和闪电链所消耗的法力值减少2%。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136116,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "震荡",
					["tips"] = "使你的震击、闪电箭和闪电链的伤害提高1%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 135807,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "大地之握",
					["tips"] = "使你的石爪图腾的生命值提高25%，地缚图腾的影响范围增加10%。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 136097,
					["ranks"] = 2,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "元素防护",
					["tips"] = "使你在被火焰、冰霜和自然系法术击中时所承受的伤害降低4%。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 136094,
					["ranks"] = 3,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "烈焰召唤",
					["tips"] = "使你的火焰图腾的伤害提高5%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 135817,
					["ranks"] = 3,
				},
			}, -- [5]
			{
				["info"] = {
					["tips"] = "你的任何火焰、冰霜或自然系的伤害性法术造成爆击之后，你都会进入节能施法状态。这个状态可以使你的下2个伤害性法术所消耗的法力值减少40%。",
					["name"] = "元素集中",
					["row"] = 3,
					["column"] = 1,
					["exceptional"] = 1,
					["icon"] = 136170,
					["ranks"] = 1,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "回响",
					["tips"] = "使你的震击法术的冷却时间减少0.2秒。",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 135850,
					["ranks"] = 5,
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "雷霆召唤",
					["tips"] = "使你的闪电箭和闪电链造成爆击的几率提高1%。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 136014,
					["ranks"] = 5,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "强化火焰图腾",
					["tips"] = "使你的火焰新星图腾激活所需的延迟时间减少1秒，熔岩图腾所造成的威胁值降低25%。",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 135824,
					["ranks"] = 2,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "风暴之眼",
					["tips"] = "使你有33%的几率在受到敌人的近战或远程爆击后获得专注施法效果，持续6秒。专注施法效果可以令你避免因为受到伤害而延长萨满祭司法术的施法时间。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 136213,
					["ranks"] = 3,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "元素浩劫",
					["tips"] = "使你的攻击性法术在造成爆击后，有一定几率令你的近战攻击爆击率提高3%，持续10秒。",
					["column"] = 4,
					["row"] = 4,
					["icon"] = 135791,
					["ranks"] = 3,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "风暴来临",
					["tips"] = "使你的闪电箭和闪电链的射程延长3码。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 136099,
					["ranks"] = 2,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "元素之怒",
					["tips"] = "使你的灼热图腾、熔岩图腾、火焰新星图腾以及你的火焰、冰霜和自然系法术的爆击伤害加成提高100%。",
					["column"] = 2,
					["row"] = 5,
					["icon"] = 135830,
					["ranks"] = 1,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "冷酷风暴",
					["tips"] = "每5秒为你恢复相当于你的智力值2%的法力值，在施法时仍然有效。",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 136111,
					["ranks"] = 5,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "元素精准",
					["tips"] = "使你的火焰、冰霜和自然系法术的命中几率提高2%，火焰、冰霜和自然系法术所造成的威胁值降低4%。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 136028,
					["ranks"] = 3,
				},
			}, -- [15]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 8,
						}, -- [1]
					},
					["name"] = "闪电掌握",
					["tips"] = "使你的闪电箭和闪电链的施法时间减少0.1秒。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 135990,
					["ranks"] = 5,
				},
			}, -- [16]
			{
				["info"] = {
					["tips"] = "激活之后，你的下一个火焰、冰霜或自然法术有100%的几率造成爆击，且法力值消耗降低100%。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "元素掌握",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136115,
					["ranks"] = 1,
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "元素之盾",
					["tips"] = "使你受到近战和远程爆击的几率降低2%。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 136030,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "闪电过载",
					["tips"] = "你的闪电箭和闪电链法术有4%的几率令你对同一个目标施放第二个完全一样的法术，不需任何法力值消耗，但是伤害减半。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 136050,
					["ranks"] = 5,
				},
			}, -- [19]
			{
				["info"] = {
					["tips"] = "在施法者身边召唤一个生命值为5点的天怒图腾，持续2分钟。这个图腾可以使周围半径20码范围内的所有小队成员的法术命中几率和法术爆击几率提高3%。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 8,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "天怒图腾",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 135829,
					["ranks"] = 1,
				},
			}, -- [20]
		},
		["info"] = {
			["name"] = "元素",
			["background"] = "ShamanElementalCombat",
		},
	}, -- [1]
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "先祖知识",
					["tips"] = "使你的法力值上限提高1%。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136162,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "盾牌专精",
					["tips"] = "使你用盾牌格挡攻击的几率提高1%，格挡成功所减免的伤害量提高5%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 134952,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "守护图腾",
					["tips"] = "使你的石肤图腾和风墙图腾所能吸收的伤害提高10%，根基图腾的冷却时间减少1秒。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 136098,
					["ranks"] = 2,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "雷鸣猛击",
					["tips"] = "使你的武器造成爆击的几率提高1%。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 132325,
					["ranks"] = 5,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "强化幽魂之狼",
					["tips"] = "使你的幽魂之狼法术的施法时间减少1秒。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 136095,
					["ranks"] = 2,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强化闪电之盾",
					["tips"] = "使你的闪电之盾的伤害提高5%。",
					["column"] = 4,
					["row"] = 2,
					["icon"] = 136051,
					["ranks"] = 3,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "强化图腾",
					["tips"] = "使你的大地之力图腾和风之优雅图腾的效果提高8%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 136023,
					["ranks"] = 2,
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "萨满专注",
					["tips"] = "在打出一次近战爆击之后，你将进入专注状态，使你的下一次震击法术所消耗的法力值减少60%。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 136027,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "预知",
					["tips"] = "使你的躲闪几率提高1%。",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 136056,
					["ranks"] = 5,
				},
			}, -- [9]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 2,
							["source"] = 4,
						}, -- [1]
					},
					["name"] = "乱舞",
					["tips"] = "在你打出爆击之后，使你的下3次近战攻击速度提高10%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 132152,
					["ranks"] = 5,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "坚韧",
					["tips"] = "使你因装备而获得的护甲值提高2%，你身上的所有移动限制效果的持续时间缩短10%。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 135892,
					["ranks"] = 5,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "强化武器图腾",
					["tips"] = "使你的风怒图腾所提供的近战攻击强度加成提高15%，火舌图腾所造成的伤害提高6%。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 135792,
					["ranks"] = 2,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "灵魂武器",
					["tips"] = "使你的近战攻击所产生的威胁值降低30%，并有一定几率招架敌人的近战攻击。",
					["column"] = 2,
					["row"] = 5,
					["icon"] = 132269,
					["ranks"] = 1,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "元素武器",
					["tips"] = "使你的石化武器所造成的伤害提高7%，风怒武器效果所造成的伤害提高13%，火舌武器和冰封武器所造成的伤害提高5%。",
					["column"] = 3,
					["row"] = 5,
					["icon"] = 135814,
					["ranks"] = 3,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "精神敏锐",
					["tips"] = "使你的瞬发型的萨满法术所消耗的法力值降低2%，并提高你的法术伤害和治疗效果，数值相当于你的攻击强度的10%。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 136055,
					["ranks"] = 3,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "武器掌握",
					["tips"] = "使你的所有武器伤害提高2%。",
					["column"] = 4,
					["row"] = 6,
					["icon"] = 132215,
					["ranks"] = 5,
				},
			}, -- [16]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "双武器专精",
					["tips"] = "使你在持双武器作战时的命中几率提高2%。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 132148,
					["ranks"] = 3,
				},
			}, -- [17]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "双武器",
					["tips"] = "使你可以在副手上装备单手和副手武器。",
					["column"] = 2,
					["row"] = 7,
					["icon"] = 132147,
					["ranks"] = 1,
				},
			}, -- [18]
			{
				["info"] = {
					["tips"] = "立即使用两把武器攻击。另外，你的下2次攻击对敌人造成的自然伤害提高20%，持续12秒。",
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "风暴打击",
					["row"] = 7,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 132314,
					["ranks"] = 1,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "怒火释放",
					["tips"] = "你的近战爆击可以令身边半径20码范围内的所有小队成员的攻击强度提高2%。效果持续10秒。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 136110,
					["ranks"] = 5,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "使你受到的所有伤害降低30%，成功的近战攻击有一定几率为你恢复法力值，数值相当于你的攻击强度的30%。持续15秒。",
					["name"] = "萨满之怒",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136088,
					["ranks"] = 1,
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "增强",
			["background"] = "ShamanEnhancement",
		},
	}, -- [2]
	{
		["numtalents"] = 20,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化治疗波",
					["tips"] = "使你的治疗波的施法时间减少0.1秒。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136052,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "潮汐集中",
					["tips"] = "使你的治疗法术所消耗的法力值减少1%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 135859,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "强化复生",
					["tips"] = "使你的复生法术的冷却时间减少10分钟，并使你在重生后所获得的生命值和法力值提高10%。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 136080,
					["ranks"] = 2,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "先祖治疗",
					["tips"] = "在你的任何一个治疗法术对目标造成爆击效果后，使目标因装备而获得的护甲值提高8%，持续15秒。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 136109,
					["ranks"] = 3,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "图腾集中",
					["tips"] = "使你的图腾所消耗的法力值减少5%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 136057,
					["ranks"] = 5,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "自然指引",
					["tips"] = "使你的法术和近战攻击的命中几率提高1%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 135860,
					["ranks"] = 3,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "治疗专注",
					["tips"] = "使你在施放任意萨满祭司治疗法术的时候有14%的几率避免因受到伤害而被打断。",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 136043,
					["ranks"] = 5,
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "图腾掌握",
					["tips"] = "你的图腾影响友方单位的半径增加到30码。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 136069,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "治疗之赐",
					["tips"] = "使你的所有治疗法术所造成的威胁值降低5%，并使你的法术被驱散的几率降低10%。",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 136041,
					["ranks"] = 3,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "恢复图腾",
					["tips"] = "使你的法力之泉图腾和治疗之泉图腾的效果提高5%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 136053,
					["ranks"] = 5,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "潮汐掌握",
					["tips"] = "使你的治疗法术的极效治疗效果和闪电法术的爆击效果提高1%。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 136107,
					["ranks"] = 5,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "治疗之道",
					["tips"] = "你的治疗波有33%的几率令你的目标由以后的治疗波获得额外的治疗效果。这个效果使目标所受到的治疗效果提高6%，持续15秒，可叠加3次。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 136044,
					["ranks"] = 3,
				},
			}, -- [12]
			{
				["info"] = {
					["tips"] = "激活之后，你的下一个施法时间低于10秒的自然法术会成为瞬发法术。",
					["name"] = "自然迅捷",
					["row"] = 5,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 136076,
					["ranks"] = 1,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "心灵专注",
					["tips"] = "使所有沉默和打断效果对萨满祭司的持续时间缩短10%。这个效果不与其它任何同类效果叠加。",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 136035,
					["ranks"] = 3,
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "净化",
					["tips"] = "使你的治疗法术的效果提高2%。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 135865,
					["ranks"] = 5,
				},
			}, -- [15]
			{
				["info"] = {
					["tips"] = "在施法者身边召唤一个生命值为5点的法力之潮图腾，持续12秒。它可以为半径20码范围内的小队成员每3秒回复6%的法力值。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 4,
							["source"] = 10,
						}, -- [1]
					},
					["name"] = "法力之潮图腾",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 135861,
					["ranks"] = 1,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "自然的守护者",
					["tips"] = "当一次伤害性的攻击使你的生命值降低到30%以下时，你有10%的几率恢复生命总值的10%，并降低你对该目标的威胁值。5秒钟冷却时间。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 136060,
					["ranks"] = 5,
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "自然的祝福",
					["tips"] = "使你的法术伤害和治疗效果提高，数值相当于你的智力值的10%。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 136059,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "强化治疗链",
					["tips"] = "使你的治疗链法术所恢复的生命值提高10%。",
					["column"] = 3,
					["row"] = 8,
					["icon"] = 136042,
					["ranks"] = 2,
				},
			}, -- [19]
			{
				["info"] = {
					["tips"] = "一层大地之盾保护目标，使其有30%的几率忽略打断施法的效果，被大地之盾保护的目标在受到攻击时可以恢复150点生命值。该效果每数秒只能出现一次，共可生效6次。大地之盾持续10分钟，同一时间内只能给一个目标施放大地之盾，且同一时间内只能有一种元素护盾在同一目标身上生效。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 8,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "大地之盾",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136089,
					["ranks"] = 1,
				},
			}, -- [20]
		},
		["info"] = {
			["name"] = "恢复",
			["background"] = "ShamanRestoration",
		},
	}, -- [3]
}
Talented_Data_DRUID = {
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "星光之怒",
					["tips"] = "使你的愤怒和星火术的施法时间减少0.1秒。",
					["column"] = 1,
					["row"] = 1,
					["icon"] = 136006,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["tips"] = "激活之后，任何击中施法者的敌人都有35%的几率被施展纠缠根须（等级 1）。只能在户外使用，可生效1次，持续45秒。",
					["name"] = "自然之握",
					["row"] = 1,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136063,
					["ranks"] = 1,
				},
			}, -- [2]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 1,
							["source"] = 2,
						}, -- [1]
					},
					["name"] = "强化自然之握",
					["tips"] = "使你的自然之握纠缠敌人的几率提高15%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 136063,
					["ranks"] = 4,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "自然控制",
					["tips"] = "使你有40%的几率在施放纠缠根须和飓风术时不会因为承受伤害而被打断。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 136100,
					["ranks"] = 3,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "汇聚星光",
					["tips"] = "使你的星火术和愤怒的爆击几率提高2%。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 135138,
					["ranks"] = 2,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强化月火术",
					["tips"] = "使你的月火术的伤害和爆击几率提高5%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 136096,
					["ranks"] = 2,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "荆刺",
					["tips"] = "使你的荆棘术和纠缠根须所造成的伤害提高25%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 136104,
					["ranks"] = 3,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "敌人被飞虫围绕，攻击命中率降低2%，在12秒内受到总计108点自然伤害。",
					["name"] = "虫群",
					["row"] = 3,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 136045,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "自然延伸",
					["tips"] = "使你的平衡系法术和精灵之火（野性）的射程延长10%。",
					["column"] = 4,
					["row"] = 3,
					["icon"] = 136065,
					["ranks"] = 2,
				},
			}, -- [9]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 2,
							["source"] = 5,
						}, -- [1]
					},
					["name"] = "复仇",
					["tips"] = "使你的星火术、月火术和愤怒的爆击伤害提高20%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 136075,
					["ranks"] = 5,
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "星空专注",
					["tips"] = "使你的星火术有5%的几率将目标击昏3秒，并使你在施放愤怒法术时受到打断效果影响的几率降低25%。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 135753,
					["ranks"] = 3,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "月神指引",
					["tips"] = "使你的法术伤害和治疗效果提高，数值相当于你的智力总值的8%。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 132132,
					["ranks"] = 3,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "自然之赐",
					["tips"] = "在你的任何法术造成爆击效果之后获得自然的赐福，使你的下一个法术的施法时间减少0.5秒。",
					["column"] = 2,
					["row"] = 5,
					["icon"] = 136062,
					["ranks"] = 1,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "月光",
					["tips"] = "使你的月火术、星火术、愤怒、治疗之触、愈合和回春术所消耗的法力值减少3%。",
					["column"] = 3,
					["row"] = 5,
					["icon"] = 136087,
					["ranks"] = 3,
				},
			}, -- [14]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "月怒",
					["tips"] = "使你的星火术、月火术和愤怒的伤害提高2%。",
					["column"] = 2,
					["row"] = 6,
					["icon"] = 136057,
					["ranks"] = 5,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "能量平衡",
					["tips"] = "使你的所有法术的命中几率提高2%，你被法术命中的几率降低2%。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 132113,
					["ranks"] = 2,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "梦境",
					["tips"] = "每5秒回复一次法力值，数值相当于你的智力值的4%，施法时也可继续生效。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 132123,
					["ranks"] = 3,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "德鲁伊进入枭兽形态，在这种形态下，护甲值提高400%，攻击强度提高，数值相当于你当前等级的150%，半径30码范围内的所有队友的法术爆击几率提高5%。近战攻击有一定几率为你回复法力值，数值取决于攻击强度。枭兽形态下只能施放平衡系的法术和驱除诅咒效果的法术。\r\n\r\n变身可以解除施法者身上的所有变形和移动限制效果。",
					["name"] = "枭兽形态",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136036,
					["ranks"] = 1,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "强化精灵之火",
					["tips"] = "你的精灵之火使目标被近战和远程攻击命中的几率提高1%。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 136033,
					["ranks"] = 3,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "塞纳留斯之怒",
					["tips"] = "你的星火术所获得的法术伤害加成效果提高4%，愤怒所获得的法术伤害加成效果提高2%。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 132146,
					["ranks"] = 5,
				},
			}, -- [20]
			{
				["info"] = {
					["tips"] = "召唤3个树人攻击敌人，持续30秒。",
					["name"] = "自然之力",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132129,
					["ranks"] = 1,
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "平衡",
			["background"] = "DruidBalance",
		},
	}, -- [1]
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "凶暴",
					["tips"] = "使你的重殴、横扫、爪击、斜掠和裂伤技能的怒气或能量消耗减少1点。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 132190,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "野性侵略",
					["tips"] = "使你的挫志咆哮的攻击强度减弱效果提高8%，凶猛撕咬技能所造成的伤害提高3%。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 132121,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "野性本能",
					["tips"] = "使你在熊和巨熊形态下所造成的威胁值提高5%，并在你潜行时降低敌人侦测到你的几率。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 132089,
					["ranks"] = 3,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "野蛮冲撞",
					["tips"] = "使你的猛击和突袭技能的击昏效果持续时间延长0.5秒。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 132114,
					["ranks"] = 2,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "厚皮",
					["tips"] = "使你由装备而得到的护甲值提高4%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 134355,
					["ranks"] = 3,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "豹之迅捷",
					["tips"] = "使你在猎豹形态下的移动速度提高15%，只能在户外生效。另外，还可使你在猎豹形态、熊形态和巨熊形态下的躲闪几率提高2%。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 136095,
					["ranks"] = 2,
				},
			}, -- [6]
			{
				["info"] = {
					["tips"] = "向目标冲锋，使其停止动作，并使其在4秒内不能施放任何法术。",
					["name"] = "野性冲锋",
					["row"] = 3,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132183,
					["ranks"] = 1,
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "锋利兽爪",
					["tips"] = "使你在猎豹、熊或巨熊形态下的爆击几率提高2%。",
					["column"] = 3,
					["row"] = 3,
					["icon"] = 134297,
					["ranks"] = 3,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "撕碎攻击",
					["tips"] = "使你的撕碎技能所消耗的能量值减少9点，割伤技能所消耗的怒气值减少1点。",
					["column"] = 1,
					["row"] = 4,
					["icon"] = 136231,
					["ranks"] = 2,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "猛兽攻击",
					["tips"] = "使你在猎豹、熊、巨熊和枭兽形态下的近战攻击强度加成提高，数值相当于你的当前等级的50%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 132185,
					["ranks"] = 3,
				},
			}, -- [10]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 3,
							["source"] = 8,
						}, -- [1]
					},
					["name"] = "原始狂怒",
					["tips"] = "使你有50%的几率在熊形态或巨熊形态下打出爆击之后获得5点额外的怒气值，你在猎豹形态下使用的任何可以增加连击点数的技能在爆击之后有50%的几率增加一个额外的连击点数。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 132278,
					["ranks"] = 2,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "野蛮暴怒",
					["tips"] = "使你的爪击、斜掠和裂伤（豹）技能的伤害提高10%。",
					["column"] = 1,
					["row"] = 5,
					["icon"] = 132141,
					["ranks"] = 2,
				},
			}, -- [12]
			{
				["info"] = {
					["tips"] = "使目标的护甲降低175点，持续40秒。在效果持续期间，目标无法潜行或隐形。",
					["name"] = "精灵之火（野性）",
					["row"] = 5,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 136033,
					["ranks"] = 1,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "治愈本能",
					["tips"] = "使你的治疗法术效果提高，数值相当于你的敏捷值的50%，并使你在猎豹形态下受到的治疗量提高10%。",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 132130,
					["ranks"] = 2,
				},
			}, -- [14]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 4,
							["source"] = 10,
						}, -- [1]
					},
					["name"] = "野性之心",
					["tips"] = "使你的智力提高4%。另外，在熊或巨熊形态下，你的耐力提高4%，在猎豹形态下，你的攻击强度提高2%。",
					["column"] = 2,
					["row"] = 6,
					["icon"] = 135879,
					["ranks"] = 5,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "适者生存",
					["tips"] = "使你的所有属性提高1%，被近战爆击的几率降低1%。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 132126,
					["ranks"] = 3,
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "原始坚韧",
					["tips"] = "使你抵抗昏迷和恐惧效果的几率提高5%。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 132139,
					["ranks"] = 3,
				},
			}, -- [17]
			{
				["info"] = {
					["tips"] = "在猎豹、熊或巨熊形态下，使半径45码范围内的所有小队成员的远程和近战攻击打出爆击的几率提高5%。",
					["name"] = "兽群领袖",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 136112,
					["ranks"] = 1,
				},
			}, -- [18]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "强化兽群领袖",
					["tips"] = "你的兽群领袖技能影响到的目标有100%的几率在打出近战或远程爆击之后恢复2%的生命值。这个治疗效果每6秒只能出现一次。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 136112,
					["ranks"] = 2,
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "狩猎天性",
					["tips"] = "在猎豹、熊或巨熊形态下，使你的近战爆击伤害提高2%，躲避范围伤害攻击的几率提高3%。",
					["column"] = 3,
					["row"] = 8,
					["icon"] = 132138,
					["ranks"] = 5,
				},
			}, -- [20]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "裂伤",
					["tips"] = "对目标造成伤害，并使流血效果对其造成的伤害提高，持续12秒。这个技能可以在猎豹形态或巨熊形态下使用。",
					["column"] = 2,
					["row"] = 9,
					["icon"] = 132135,
					["ranks"] = 1,
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "野性战斗",
			["background"] = "DruidFeralCombat",
		},
	}, -- [2]
	{
		["numtalents"] = 20,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化野性印记",
					["tips"] = "使你的野性印记和野性赐福的效果提高7%。",
					["column"] = 2,
					["row"] = 1,
					["icon"] = 136078,
					["ranks"] = 5,
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "激怒",
					["tips"] = "使你有20%的几率在进入熊形态和巨熊形态时获得10点怒气值，或者在进入猎豹形态时获得40点能量值。",
					["column"] = 3,
					["row"] = 1,
					["icon"] = 135881,
					["ranks"] = 5,
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "自然主义",
					["tips"] = "使你的治疗之触的施法时间减少0.1秒，你在所有形态下的物理攻击所造成的伤害提高2%。",
					["column"] = 1,
					["row"] = 2,
					["icon"] = 136041,
					["ranks"] = 5,
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "自然集中",
					["tips"] = "使你在施放愈合、治疗之触或宁静时有14%的几率不因受到伤害而被打断。",
					["column"] = 2,
					["row"] = 2,
					["icon"] = 136042,
					["ranks"] = 5,
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "自然变形",
					["tips"] = "使你的所有变形法术所消耗的法力值降低10%。",
					["column"] = 3,
					["row"] = 2,
					["icon"] = 136116,
					["ranks"] = 3,
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "强烈",
					["tips"] = "使你在施法时仍保持10%的法力值恢复速度，并使你在使用激怒技能时立即获得4点怒气值。",
					["column"] = 1,
					["row"] = 3,
					["icon"] = 135863,
					["ranks"] = 3,
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "微妙",
					["tips"] = "使你的法术造成的威胁值降低4%，并使你的法术被驱散的几率降低6%。",
					["column"] = 2,
					["row"] = 3,
					["icon"] = 132150,
					["ranks"] = 5,
				},
			}, -- [7]
			{
				["info"] = {
					["tips"] = "以自然的力量强化德鲁伊的武器，每次近战攻击命中敌人都有一定几率令德鲁伊进入节能施法状态。该状态可以让你的下一个伤害法术、治疗法术或攻击技能所消耗的法力值、怒气值或能量值降低100%。清晰预兆效果可持续30分钟。",
					["name"] = "清晰预兆",
					["row"] = 3,
					["column"] = 3,
					["exceptional"] = 1,
					["icon"] = 136017,
					["ranks"] = 1,
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "宁静之魂",
					["tips"] = "使你的治疗之触和宁静所消耗的法力值减少2%。",
					["column"] = 2,
					["row"] = 4,
					["icon"] = 135900,
					["ranks"] = 5,
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化回春术",
					["tips"] = "使你的回春术的效果提高5%。",
					["column"] = 3,
					["row"] = 4,
					["icon"] = 136081,
					["ranks"] = 3,
				},
			}, -- [10]
			{
				["info"] = {
					["tips"] = "激活之后，你的下一个自然法术会成为瞬发法术。",
					["prereqs"] = {
						{
							["column"] = 1,
							["row"] = 3,
							["source"] = 6,
						}, -- [1]
					},
					["name"] = "自然迅捷",
					["row"] = 5,
					["column"] = 1,
					["exceptional"] = 1,
					["icon"] = 136076,
					["ranks"] = 1,
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "自然赐福",
					["tips"] = "使你的所有治疗法术的效果提高2%。",
					["column"] = 2,
					["row"] = 5,
					["icon"] = 136074,
					["ranks"] = 5,
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "强化宁静",
					["tips"] = "使你的宁静法术导致的威胁值降低50%。",
					["column"] = 4,
					["row"] = 5,
					["icon"] = 136107,
					["ranks"] = 2,
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "治疗之触增效",
					["tips"] = "提高法术治疗的效果对你的治疗之触有10%的额外加成。",
					["column"] = 1,
					["row"] = 6,
					["icon"] = 132125,
					["ranks"] = 2,
				},
			}, -- [14]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 4,
							["source"] = 10,
						}, -- [1]
					},
					["name"] = "强化愈合",
					["tips"] = "使你的愈合法术的爆击几率提高10%。",
					["column"] = 3,
					["row"] = 6,
					["icon"] = 136085,
					["ranks"] = 5,
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "生命之魂",
					["tips"] = "使你的精神总值提高5%。",
					["column"] = 1,
					["row"] = 7,
					["icon"] = 136037,
					["ranks"] = 3,
				},
			}, -- [16]
			{
				["info"] = {
					["tips"] = "吞噬友方目标身上的一个回春术或愈合的持续效果，并立即为其回复生命值，其数值等于12秒的回春效果或18秒的愈合效果。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 12,
						}, -- [1]
					},
					["name"] = "迅捷治愈",
					["row"] = 7,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 134914,
					["ranks"] = 1,
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "天然完美",
					["tips"] = "你的法术爆击几率提高1%，受到近战和远程爆击之后会获得天然完美效果，使你承受的所有伤害降低2%。可叠加最多3次，效果持续8秒。",
					["column"] = 3,
					["row"] = 7,
					["icon"] = 132137,
					["ranks"] = 3,
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "回春增效",
					["tips"] = "提高法术治疗的效果对你的持续治疗法术有4%的额外加成。",
					["column"] = 2,
					["row"] = 8,
					["icon"] = 132124,
					["ranks"] = 5,
				},
			}, -- [19]
			{
				["info"] = {
					["tips"] = "德鲁伊进入生命之树形态。在这种形态下，你身边半径45码范围内的所有队友受到的治疗效果提高，数值相当于你的精神总值的25%。你的移动速度降低20%，并且只能施放迅捷治愈、激活、自然迅捷、复生、解除中毒效果的法术和持续性治疗法术，但这些法术所消耗的法力值也降低20%。\r\n\r\n变身可以解除施法者身上的一切变形和移动限制效果。",
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 8,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "生命之树",
					["row"] = 9,
					["column"] = 2,
					["exceptional"] = 1,
					["icon"] = 132145,
					["ranks"] = 1,
				},
			}, -- [20]
		},
		["info"] = {
			["name"] = "恢复",
			["background"] = "DruidRestoration",
		},
	}, -- [3]
}
Talented_Data_ROGUE = {
	{
		["numtalents"] = 21,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化刺骨",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132292,
					["row"] = 1,
					["tips"] = "使你的刺骨技能所造成的伤害提高5%。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "冷酷攻击",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 132151,
					["row"] = 1,
					["tips"] = "在你杀死一个可为你提供经验值或荣誉值的敌人后，你的下一次影袭、出血、背刺、毁伤、伏击或鬼魅攻击有20%的额外几率造成爆击，效果持续20秒。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "恶意",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132277,
					["row"] = 1,
					["tips"] = "使你的爆击几率提高1%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "无情",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132122,
					["row"] = 2,
					["tips"] = "使你的终结技有20%的几率为目标增加一个连击点数。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "密谋",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 136147,
					["row"] = 2,
					["tips"] = "使你对人形生物、巨人、野兽和龙类目标造成的所有伤害提高1%。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "穿刺之伤",
					["ranks"] = 3,
					["column"] = 4,
					["icon"] = 132090,
					["row"] = 2,
					["tips"] = "使你的背刺技能的爆击几率提高10%，毁伤技能的爆击几率提高5%。",
				},
			}, -- [6]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "无情打击",
					["icon"] = 132340,
					["column"] = 1,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "你的终结技有每连击点数20%的几率恢复25点能量值。",
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "强化破甲",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 132354,
					["row"] = 3,
					["tips"] = "使你的破甲技能令目标护甲值降低的效果提高25%。",
				},
			}, -- [8]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 1,
							["source"] = 3,
						}, -- [1]
					},
					["name"] = "致命偷袭",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132109,
					["row"] = 3,
					["tips"] = "使你的影袭、凿击、背刺、鬼魅攻击、毁伤、毒刃和出血技能的爆击伤害加成提高6%。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "剧毒",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132293,
					["row"] = 4,
					["tips"] = "使你的毒药和毒伤技能所造成的伤害提高4%，并使你的毒药抵抗驱散效果的几率提高8%。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "强化药膏",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132273,
					["row"] = 4,
					["tips"] = "使你对目标施放毒药的几率提高2%。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "健步如飞",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132296,
					["row"] = 5,
					["tips"] = "使你抵抗移动限制效果的几率提高5%，并使你的移动速度提高8%。不与其它提高移动速度的效果叠加。",
				},
			}, -- [12]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "冷血",
					["icon"] = 135988,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "激活之后，你的下一次攻击技能的爆击几率提高100%。",
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "强化肾击",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132298,
					["row"] = 5,
					["tips"] = "目标受到你的肾击技能影响之后，任何攻击者对其所造成的伤害量都提高3%。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "快速恢复",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 132301,
					["row"] = 5,
					["tips"] = "对你施加的所有治疗效果提高10%。另外，你的终结技如果未能命中目标，则它消耗的能量值减少40%。",
				},
			}, -- [15]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "封印命运",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 136130,
					["row"] = 6,
					["tips"] = "如果你的某个可以增加连击点数的技能造成了爆击，那么它就有20%的几率增加一个额外的连击点数。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "奇毒",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 132108,
					["row"] = 6,
					["tips"] = "使你的毒药被抵抗的几率降低5%，你抵抗中毒效果的几率提高15%。",
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "精力",
					["ranks"] = 1,
					["column"] = 2,
					["icon"] = 136023,
					["row"] = 7,
					["tips"] = "使你的能量值上限提高10点。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "勇气衰竭",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132286,
					["row"] = 7,
					["tips"] = "受到的所有物理伤害降低1%。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "寻找弱点",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132295,
					["row"] = 8,
					["tips"] = "你的终结技会使你的所有攻击技能所造成的伤害提高2%，效果持续10秒。",
				},
			}, -- [20]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 18,
						}, -- [1]
					},
					["name"] = "毁伤",
					["icon"] = 132304,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "同时用两把武器攻击目标，每把武器所造成的伤害都提高44点。如果目标处于中毒状态，则对其造成的伤害提高50%。必须从目标背后发动，奖励2个连击点数。",
				},
			}, -- [21]
		},
		["info"] = {
			["name"] = "奇袭",
			["background"] = "RogueAssassination",
		},
	}, -- [1]
	{
		["numtalents"] = 24,
		["talents"] = {
			{
				["info"] = {
					["name"] = "强化凿击",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132155,
					["row"] = 1,
					["tips"] = "使你的凿击技能的效果持续时间延长0.5秒。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "强化影袭",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 136189,
					["row"] = 1,
					["tips"] = "使你的影袭技能所消耗的能量值减少3点。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "闪电反射",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 136047,
					["row"] = 1,
					["tips"] = "使你的躲闪几率提高1%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "强化切割",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132306,
					["row"] = 2,
					["tips"] = "使你的切割技能的效果持续时间延长15%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "偏斜",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132269,
					["row"] = 2,
					["tips"] = "使你的招架几率提高1%。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "精确",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132222,
					["row"] = 2,
					["tips"] = "使你的武器命中几率提高1%。",
				},
			}, -- [6]
			{
				["info"] = {
					["name"] = "耐久",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 136205,
					["row"] = 3,
					["tips"] = "使你的疾跑和闪避技能的冷却时间降低45秒。",
				},
			}, -- [7]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 2,
							["source"] = 5,
						}, -- [1]
					},
					["name"] = "还击",
					["icon"] = 132336,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "在招架了敌人的攻击之后可以使用的技能，对目标造成150%的武器伤害，并使其被缴械，持续6秒。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "强化疾跑",
					["ranks"] = 2,
					["column"] = 4,
					["icon"] = 132307,
					["row"] = 3,
					["tips"] = "使你在启动疾跑技能时有50%的几率移除所有移动限制效果。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "强化脚踢",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132219,
					["row"] = 4,
					["tips"] = "使你的脚踢技能有50%的几率令目标沉默2秒。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "匕首专精",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 135641,
					["row"] = 4,
					["tips"] = "使你的匕首造成爆击的几率提高1%。",
				},
			}, -- [11]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 2,
							["source"] = 6,
						}, -- [1]
					},
					["name"] = "双武器专精",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132147,
					["row"] = 4,
					["tips"] = "使你的副手武器伤害提高10%。",
				},
			}, -- [12]
			{
				["info"] = {
					["name"] = "锤类武器专精",
					["ranks"] = 5,
					["column"] = 1,
					["icon"] = 133476,
					["row"] = 5,
					["tips"] = "使你的锤类武器爆击之后所造成的伤害提高1%，用锤类武器击中目标时有1%的几率将其击晕3秒。",
				},
			}, -- [13]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "剑刃乱舞",
					["icon"] = 132350,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "使你的攻击速度提高20%。另外还可以对附近的一个额外的敌人造成伤害。持续15秒。",
				},
			}, -- [14]
			{
				["info"] = {
					["name"] = "剑类武器专精",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135328,
					["row"] = 5,
					["tips"] = "使你在用剑类武器击中敌人后有1%的几率对同一目标进行一次额外的攻击。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "拳套专精",
					["ranks"] = 5,
					["column"] = 4,
					["icon"] = 132938,
					["row"] = 5,
					["tips"] = "使你的拳套造成爆击的几率提高1%。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "利刃漩涡",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132283,
					["row"] = 6,
					["tips"] = "你的影袭、背刺、凿击和毒刃技能有10%的几率令目标眩晕8秒。",
				},
			}, -- [17]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 14,
						}, -- [1]
					},
					["name"] = "武器专家",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 135882,
					["row"] = 6,
					["tips"] = "使你的精准值提高5点。",
				},
			}, -- [18]
			{
				["info"] = {
					["name"] = "侵犯",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132275,
					["row"] = 6,
					["tips"] = "使你的影袭、背刺和刺骨技能的伤害提高2%。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "活力",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132353,
					["row"] = 7,
					["tips"] = "使你的耐力总值提高2%，敏捷总值提高1%。",
				},
			}, -- [20]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "冲动",
					["icon"] = 136206,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "使你的能量值回复速度提高100%，持续15秒。",
				},
			}, -- [21]
			{
				["info"] = {
					["name"] = "钢铁勇气",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 132300,
					["row"] = 7,
					["tips"] = "使你抵抗昏迷和恐惧效果的几率提高5%。",
				},
			}, -- [22]
			{
				["info"] = {
					["name"] = "作战潜能",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135673,
					["row"] = 8,
					["tips"] = "你的副手近战攻击命中后有20%的几率回复3点能量值。",
				},
			}, -- [23]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 21,
						}, -- [1]
					},
					["name"] = "突袭",
					["icon"] = 132308,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "你的终结技无法被躲闪，你的影袭、背刺、毒刃和凿击技能所造成的伤害提高10%。",
				},
			}, -- [24]
		},
		["info"] = {
			["name"] = "战斗",
			["background"] = "RogueCombat",
		},
	}, -- [2]
	{
		["numtalents"] = 22,
		["talents"] = {
			{
				["info"] = {
					["name"] = "欺诈高手",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 136129,
					["row"] = 1,
					["tips"] = "当你在潜行状态下时，降低敌人侦测到你的几率。",
				},
			}, -- [1]
			{
				["info"] = {
					["name"] = "伺机而动",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132366,
					["row"] = 1,
					["tips"] = "使你在从背后使用背刺、毁伤、锁喉或伏击技能偷袭敌人时的伤害提高4%。",
				},
			}, -- [2]
			{
				["info"] = {
					["name"] = "狡诈",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132294,
					["row"] = 2,
					["tips"] = "使你受到近战和远程爆击的几率降低1%，并使你的佯攻技能降低仇恨的效果提高10%。",
				},
			}, -- [3]
			{
				["info"] = {
					["name"] = "邪恶计谋",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 132310,
					["row"] = 2,
					["tips"] = "使你的致盲和闷棍技能的射程延长2码，致盲和闷棍技能所消耗的能量值减少25%。",
				},
			}, -- [4]
			{
				["info"] = {
					["name"] = "伪装",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 132320,
					["row"] = 2,
					["tips"] = "使你在潜行后的移动速度提高3%，潜行技能的冷却时间降低1秒。",
				},
			}, -- [5]
			{
				["info"] = {
					["name"] = "先发制人",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 136159,
					["row"] = 3,
					["tips"] = "使你有25%的几率在使用伏击、锁喉或偷袭技能后获得1个额外的连击点数。",
				},
			}, -- [6]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "鬼魅攻击",
					["icon"] = 136136,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 3,
					["tips"] = "对敌人造成125%的武器伤害，并使你躲闪攻击的几率提高15%，持续7秒。奖励1个连击点数。",
				},
			}, -- [7]
			{
				["info"] = {
					["name"] = "强化伏击",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132282,
					["row"] = 3,
					["tips"] = "使你的伏击技能造成爆击的几率提高15%。",
				},
			}, -- [8]
			{
				["info"] = {
					["name"] = "调整",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 136056,
					["row"] = 4,
					["tips"] = "使你有15%的几率在成功躲闪敌人的攻击或完全抵抗一个法术之后获得一个连击点数。",
				},
			}, -- [9]
			{
				["info"] = {
					["name"] = "飘忽不定",
					["ranks"] = 2,
					["column"] = 2,
					["icon"] = 135994,
					["row"] = 4,
					["tips"] = "使你的消失和致盲技能的冷却时间缩短45秒。",
				},
			}, -- [10]
			{
				["info"] = {
					["name"] = "锯齿利刃",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 135315,
					["row"] = 4,
					["tips"] = "使你的攻击忽视目标160点护甲，并使你的割裂技能所造成的伤害提高10%。削弱目标护甲的效果随着你的等级提高而提高。",
				},
			}, -- [11]
			{
				["info"] = {
					["name"] = "察觉",
					["ranks"] = 2,
					["column"] = 1,
					["icon"] = 132089,
					["row"] = 5,
					["tips"] = "使你的潜行侦测能力提高，并使你被法术和远程攻击命中的几率降低2%。",
				},
			}, -- [12]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "伺机待发",
					["icon"] = 136121,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "激活之后，这项技能立刻使你的闪避、疾跑、消失、冷血、暗影步和预谋技能的冷却时间结束。",
				},
			}, -- [13]
			{
				["info"] = {
					["name"] = "卑鄙",
					["ranks"] = 2,
					["column"] = 3,
					["icon"] = 136220,
					["row"] = 5,
					["tips"] = "使你的偷袭和锁喉技能所消耗的能量值减少10点。另外，你的特殊技能对生命值低于35%的目标所造成的伤害提高10%。",
				},
			}, -- [14]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 3,
							["row"] = 4,
							["source"] = 11,
						}, -- [1]
					},
					["name"] = "出血",
					["icon"] = 136168,
					["column"] = 4,
					["exceptional"] = 1,
					["row"] = 5,
					["tips"] = "立即对目标造成110%的武器伤害，并令其流血，使其在受到物理攻击时所承受的伤害提高最多13点。可最多生效10次，或者持续15秒。奖励1个连击点数。",
				},
			}, -- [15]
			{
				["info"] = {
					["name"] = "敏锐大师",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132299,
					["row"] = 6,
					["tips"] = "在潜行状态和解除潜行状态后的6秒内进行的攻击所造成的伤害提高4%。",
				},
			}, -- [16]
			{
				["info"] = {
					["name"] = "极致",
					["ranks"] = 5,
					["column"] = 3,
					["icon"] = 135540,
					["row"] = 6,
					["tips"] = "攻击强度提高2%。",
				},
			}, -- [17]
			{
				["info"] = {
					["name"] = "覆体之影",
					["ranks"] = 3,
					["column"] = 1,
					["icon"] = 132291,
					["row"] = 7,
					["tips"] = "使你躲避范围伤害攻击的几率提高5%。",
				},
			}, -- [18]
			{
				["info"] = {
					["ranks"] = 1,
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 5,
							["source"] = 13,
						}, -- [1]
					},
					["name"] = "预谋",
					["icon"] = 136183,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 7,
					["tips"] = "使用此技能后，为你的当前目标增加2个连击点数。你必须在10秒内消耗掉这些点数，或者为其增加新的连击点数，否则它们就会消失。",
				},
			}, -- [19]
			{
				["info"] = {
					["name"] = "装死",
					["ranks"] = 3,
					["column"] = 3,
					["icon"] = 132285,
					["row"] = 7,
					["tips"] = "你有33%的几率令任何可以导致你死亡的攻击对你造成的伤害只相当于你的生命值上限的10%，并且使你受到的所有伤害降低最多90%，持续3秒（减免数值受韧性影响）。这个效果每1分钟只能触发一次。",
				},
			}, -- [20]
			{
				["info"] = {
					["prereqs"] = {
						{
							["column"] = 2,
							["row"] = 7,
							["source"] = 19,
						}, -- [1]
					},
					["name"] = "邪恶召唤",
					["ranks"] = 5,
					["column"] = 2,
					["icon"] = 132305,
					["row"] = 8,
					["tips"] = "使你的敏捷总值提高3%，并使背刺和出血技能的百分比伤害加成提高1%。",
				},
			}, -- [21]
			{
				["info"] = {
					["ranks"] = 1,
					["name"] = "暗影步",
					["icon"] = 132303,
					["column"] = 2,
					["exceptional"] = 1,
					["row"] = 9,
					["tips"] = "尝试在暗影中行进，并出现在你的目标身后，移动速度提高70%，持续3秒。你的下一个技能所造成的伤害提高20%，威胁值降低50%。持续10秒。",
				},
			}, -- [22]
		},
		["info"] = {
			["name"] = "敏锐",
			["background"] = "RogueSubtlety",
		},
	}, -- [3]
}
